Repository: solosciences/configs
Catalog: postgis-3.0.1/doc/po/*/using_postgis_dataman.xml.po
Languages: de

source: We can add additional columns using standard ALTER TABLE command as we do in this next example where we add a 3-D linestring.
de: Wir können zusätzliche Spalten hinzufügen, indem wir den normalen ALTER TABLE Befehl verwenden. Wir zeigen dies im nächsten Beispiel, wo wir einen 3D-Linienzug hinzufügen.

source: Manually Registering Geometry Columns in geometry_columns
de: Geometrische Spalten in "geometry_columns" händisch registrieren

source: Two of the cases where you may need this are the case of SQL Views and bulk inserts. For bulk insert case, you can correct the registration in the geometry_columns table by constraining the column or doing an alter table. For views, you could expose using a CAST operation. Note, if your column is typmod based, the creation process would register it correctly, so no need to do anything. Also views that have no spatial function applied to the geometry will register the same as the underlying table geometry column.
de: Zwei Fälle bei denen Sie dies benötigen könnten sind SQL-Views und Masseninserts. Beim Fall von Masseninserts können Sie die Registrierung in der Tabelle "geometry_columns" korrigieren, indem Sie auf die Spalte einen CONSTRAINT setzen oder ein "ALTER TABLE" durchführen. Falls Ihre Spalte Typmod basiert ist, geschieht die Registrierung beim Erstellungsprozess auf korrekte Weise, so dass Sie hier nichts tun müssen. Auch Views, bei denen keine räumliche Funktion auf die Geometrie angewendet wird, werden auf gleiche Weise wie die Geometrie der zugrunde liegenden Tabelle registriert.

source: -- Lets say you have a view created like this CREATE VIEW public.vwmytablemercator AS SELECT gid, ST_Transform(geom, 3395) As geom, f_name FROM public.mytable; -- For it to register correctly -- You need to cast the geometry -- DROP VIEW public.vwmytablemercator; CREATE VIEW public.vwmytablemercator AS SELECT gid, ST_Transform(geom, 3395)::geometry(Geometry, 3395) As geom, f_name FROM public.mytable; -- If you know the geometry type for sure is a 2D POLYGON then you could do DROP VIEW public.vwmytablemercator; CREATE VIEW public.vwmytablemercator AS SELECT gid, ST_Transform(geom,3395)::geometry(Polygon, 3395) As geom, f_name FROM public.mytable;
de: -- Angenommen Sie erstellen folgenden View CREATE VIEW public.vwmytablemercator AS SELECT gid, ST_Transform(geom,3395) As geom, f_name FROM public.mytable; -- Für eine korrekte Registrierung -- wird eine Typumwandlung der Geometrie benötigt -- DROP VIEW public.vwmytablemercator; CREATE VIEW public.vwmytablemercator AS SELECT gid, ST_Transform(geom,3395)::geometry(Geometry, 3395) As geom, f_name FROM public.mytable; -- Wenn Sie sicher sind, das es sich bei der Geometrie um ein 2D-Polygon handelt, können Sie folgendes tun DROP VIEW public.vwmytablemercator; CREATE VIEW public.vwmytablemercator AS SELECT gid, ST_Transform(geom,3395)::geometry(Polygon, 3395) As geom, f_name FROM public.mytable;

source: --Lets say you created a derivative table by doing a bulk insert SELECT poi.gid, poi.geom, citybounds.city_name INTO myschema.my_special_pois FROM poi INNER JOIN citybounds ON ST_Intersects(citybounds.geom, poi.geom); -- Create 2D index on new table CREATE INDEX idx_myschema_myspecialpois_geom_gist ON myschema.my_special_pois USING gist(geom); -- If your points are 3D points or 3M points, -- then you might want to create an nd index instead of a 2D index CREATE INDEX my_special_pois_geom_gist_nd ON my_special_pois USING gist(geom gist_geometry_ops_nd); -- To manually register this new table's geometry column in geometry_columns. -- Note it will also change the underlying structure of the table to -- to make the column typmod based. SELECT populate_geometry_columns('myschema.my_special_pois'::regclass); -- If you are using PostGIS 2.0 and for whatever reason, you -- you need the constraint based definition behavior -- (such as case of inherited tables where all children do not have the same type and srid) -- set optional use_typmod argument to false SELECT populate_geometry_columns('myschema.my_special_pois'::regclass, false);
de: -- Angenommen Sie haben eine abgeleitete Tabelle über ein Masseninsert erzeugt SELECT poi.gid, poi.geom, citybounds.city_name INTO myschema.my_special_pois FROM poi INNER JOIN citybounds ON ST_Intersects(citybounds.geom, poi.geom); -- Einen 2D Index auf die neue Tabelle legen CREATE INDEX idx_myschema_myspecialpois_geom_gist ON myschema.my_special_pois USING gist(geom); -- Falls Ihre Punkte 3D-Punkte oder 3M-Punkte sind, -- können Sie einen ND-Index anstatt eines 2D-Indexes erstellen CREATE INDEX my_special_pois_geom_gist_nd ON my_special_pois USING gist(geom gist_geometry_ops_nd); -- Um die Geometriespalte der neuen Tabelle in geometry_columns händisch zu registrieren. -- Beachten Sie bitte, dass dies auch die zugrundeliegende Struktur der Tabelle ändert, -- um die Spalte Typmod basiert zu machen. SELECT populate_geometry_columns('myschema.my_special_pois'::regclass); -- Wenn Sie PostGIS 2.0 verwenden und aus welchem Grund auch immer -- das alte Verhalten mit auf CONSTRAINTs basierender Definition benötigen -- (wie im Fall von vererbten Tabellen bei denen nicht alle Kindtabellen denselben Datentyp und dieselbe SRID aufweisen), -- setzen Sie das optionale Argument "use_typmod" auf FALSE SELECT populate_geometry_columns('myschema.my_special_pois'::regclass, false);

source: Although the old-constraint based method is still supported, a constraint-based geometry column used directly in a view, will not register correctly in geometry_columns, as will a typmod one. In this example we define a column using typmod and another using constraints.
de: Obwohl die alte auf CONSTRAINTs basierte Methode immer noch unterstützt wird, wird eine auf Constraints basierende Geometriespalte, die direkt in einem View verwendet wird, nicht korrekt in geometry_columns registriert. Eine Typmod basierte wird korrekt registriert. Im folgenden Beispiel definieren wir eine Spalte mit Typmod und eine andere mit Constraints.

source: If we run in psql
de: In psql:

source: We observe they are defined differently -- one is typmod, one is constraint
de: Wir sehen, das diese Spalten unterschiedlich definiert sind -- eine mittels Typmodifizierer, eine nutzt einen Constraint

source: In geometry_columns, they both register correctly
de: Beide registrieren sich korrekt in "geometry_columns"

source: However -- if we were to create a view like this
de: Jedoch -- wenn wir einen View auf die folgende Weise erstellen

source: The typmod based geom view column registers correctly, but the constraint based one does not.
de: Die Typmod basierte geometrische Spalte eines View registriert sich korrekt, die auf Constraint basierende nicht.

source: This may change in future versions of PostGIS, but for now To force the constraint based view column to register correctly, we need to do this:
de: Dies kann sich bei zukünftigen Versionen von PostGIS ändern, vorerst müssen Sie aber folgendes ausführen, um die auf Constraint basierende Spalte eines View korrekt zu registrieren:

source: Ensuring OpenGIS compliancy of geometries
de: Wahrung der OGC-Konformität von Geometrien

source: PostGIS is compliant with the Open Geospatial Consortium’s (OGC) OpenGIS Specifications. As such, many PostGIS methods require, or more accurately, assume that geometries that are operated on are both simple and valid. For example, it does not make sense to calculate the area of a polygon that has a hole defined outside of the polygon, or to construct a polygon from a non-simple boundary line.
de: PostGIS ist mit den Open Geospatial Consortium (OGC) OpenGIS Spezifikationen konform. Daher setzen viele PostGIS Methoden voraus, dass die Geometrien mit denen sie rechnen sowohl "Simple" als auch "Valid" sind . Zum Beispiel hat es keinen Sinn, die Fläche eines Polygons zu berechnen, das eine Insel aufweist, die ausserhalb des Polygons festgelegt ist, oder ein Polygon aus einer Begrenzungslinie zu konstruieren, welche nicht "simple" ist.

source: According to the OGC Specifications, a <emphasis>simple</emphasis> geometry is one that has no anomalous geometric points, such as self intersection or self tangency and primarily refers to 0 or 1-dimensional geometries (i.e. <varname>[MULTI]POINT, [MULTI]LINESTRING</varname>). Geometry validity, on the other hand, primarily refers to 2-dimensional geometries (i.e. <varname>[MULTI]POLYGON)</varname> and defines the set of assertions that characterizes a valid polygon. The description of each geometric class includes specific conditions that further detail geometric simplicity and validity.
de: Entsprechend der OGC Spezifikationen ist eine <emphasis>simple</emphasis> Geometrie eine solche, die sich nicht selbst überschneidet oder berührt und bezieht sich in erster Linie auf 0- und 1-dimensionale Geometrien (insbesondere <varname>[MULTI]POINT, [MULTI]LINESTRING</varname>). Andererseits bezieht sich die Validität einer Geometrie hauptsächlich auf 2-dimensionale Geometrien (insbesondere <varname>[MULTI]POLYGON)</varname> und definiert die Menge an Aussagen, welche ein valides/gültiges Polygon auszeichnen. Die Beschreibung einer jeden geometrischen Klasse schließt bestimmte Bedingungen mit ein, welche die Simplizität und Validität von Geometrien näher beschreiben.

source: A <varname>POINT</varname> is inheritably <emphasis>simple</emphasis> as a 0-dimensional geometry object.
de: Da ein <varname>POINT</varname> ein 0-dimensionales geometrisches Objekt ist, ist er von vornherein <emphasis>simple</emphasis>.

source: <varname>MULTIPOINT</varname>s are <emphasis>simple</emphasis> if no two coordinates (<varname>POINT</varname>s) are equal (have identical coordinate values).
de: <varname>MULTIPOINT</varname>s sind <emphasis>simple</emphasis>, wenn sich keine zwei Koordinaten (<varname>POINT</varname>s) decken (keine identischen Koordinatenpaare aufweisen).

source: A <varname>LINESTRING</varname> is <emphasis>simple</emphasis> if it does not pass through the same <varname>POINT</varname> twice (except for the endpoints, in which case it is referred to as a linear ring and additionally considered closed).
de: Ein <varname>LINESTRING</varname> ist <emphasis>simple</emphasis>, wenn er nicht zweimal durch denselben <varname>POINT</varname> geht (ausgenommen bei Endpunkten, wo dieser als linearer Ring benannt wird und zusätzlich als geschlossen angesehen wird).

source: <emphasis role="bold">(a)</emphasis> and <emphasis role="bold">(c)</emphasis> are simple <varname>LINESTRING</varname>s, <emphasis role="bold">(b)</emphasis> and <emphasis role="bold">(d)</emphasis> are not.
de: <emphasis role="bold">(a)</emphasis> und <emphasis role="bold">(c)</emphasis> sind simple <varname>LINESTRING</varname>s, <emphasis role="bold">(b)</emphasis> und <emphasis role="bold">(d)</emphasis> nicht.

source: A <varname>MULTILINESTRING</varname> is <emphasis>simple</emphasis> only if all of its elements are simple and the only intersection between any two elements occurs at <varname>POINT</varname>s that are on the boundaries of both elements.
de: Ein <varname>MULTILINESTRING</varname> ist nur dann <emphasis>simple</emphasis>, wenn alle seine Elemente "simple" sind und die einzigen Überschneidungen zwischen zwei Elementen nur an jenen <varname>POINT</varname>s auftreten, die an den Begrenzungen der beiden Elemente liegen.

source: <emphasis role="bold">(e)</emphasis> and <emphasis role="bold">(f)</emphasis> are simple <varname>MULTILINESTRING</varname>s, <emphasis role="bold">(g)</emphasis> is not.
de: <emphasis role="bold">(e)</emphasis> und <emphasis role="bold">(f)</emphasis> sind simple <varname>MULTILINESTRING</varname>s, <emphasis role="bold">(g)</emphasis> nicht.

source: By definition, a <varname>POLYGON</varname> is always <emphasis>simple</emphasis>. It is <emphasis>valid</emphasis> if no two rings in the boundary (made up of an exterior ring and interior rings) cross. The boundary of a <varname>POLYGON</varname> may intersect at a <varname>POINT</varname> but only as a tangent (i.e. not on a line). A <varname>POLYGON</varname> may not have cut lines or spikes and the interior rings must be contained entirely within the exterior ring.
de: Definitionsgemäß ist ein <varname>POLYGON</varname> immer <emphasis>simple</emphasis>. Es ist <emphasis>valid</emphasis>, wenn sich keine zwei Ringe an der Begrenzung (bestehend aus einem äußeren Ring und inneren Ringen) kreuzen. Die Begrenzung eines <varname>POLYGON</varname>s darf an einem <varname>POINT</varname> schneiden, allerdings nur als Tangente (insbesondere nicht an einer Linie). Ein <varname>POLYGON</varname> darf keine Schnittlinien oder "Spikes" aufweisen und die inneren Ringe müssen zur Gänze im äußeren Ring enthalten sein.

source: <emphasis role="bold">(h)</emphasis> and <emphasis role="bold">(i)</emphasis> are valid <varname>POLYGON</varname>s, <emphasis role="bold">(j-m)</emphasis> cannot be represented as single <varname>POLYGON</varname>s, but <emphasis role="bold">(j)</emphasis> and <emphasis role="bold">(m)</emphasis> could be represented as a valid <varname>MULTIPOLYGON</varname>.
de: <emphasis role="bold">(h)</emphasis> und <emphasis role="bold">(i)</emphasis> sind valide <varname>POLYGON</varname>e, <emphasis role="bold">(j-m)</emphasis> können nicht als einzelne <varname>POLYGON</varname>e dargestellt werden, aber <emphasis role="bold">(j)</emphasis> und <emphasis role="bold">(m)</emphasis> können als ein valides <varname>MULTIPOLYGON</varname> dargestellt werden.

source: A <varname>MULTIPOLYGON</varname> is <emphasis>valid</emphasis> if and only if all of its elements are valid and the interiors of no two elements intersect. The boundaries of any two elements may touch, but only at a finite number of <varname>POINT</varname>s.
de: Ein <varname>MULTIPOLYGON</varname> ist dann und nur dann <emphasis>valid</emphasis>e, wenn alle seine Elemente valide sind und sich das Innere zweier Elemente nicht überschneidet. Die Begrenzungen zweier Elemente können sich berühren, allerdings nur an einer endlichen Anzahl von <varname>POINT</varname>s.

source: <emphasis role="bold">(n)</emphasis> and <emphasis role="bold">(o)</emphasis> are not valid <varname>MULTIPOLYGON</varname>s. <emphasis role="bold">(p)</emphasis>, however, is valid.
de: <emphasis role="bold">(n)</emphasis> und <emphasis role="bold">(o)</emphasis> sind keine validen <varname>MULTIPOLYGON</varname>s. Hingegen ist <emphasis role="bold">(p)</emphasis> valid.

source: Most of the functions implemented by the GEOS library rely on the assumption that your geometries are valid as specified by the OpenGIS Simple Feature Specification. To check simplicity or validity of geometries you can use the <link linkend="ST_IsSimple">ST_IsSimple()</link> and <link linkend="ST_IsValid">ST_IsValid()</link>
de: Die meisten von der GEOS Bibliothek implementierten Funktionen beruhen auf der Annahme, dass die verwendete Geometrie - entsprechend der OpenGIS Simple Feature Spezifikation - valide ist. Um die Simplizität und Validität einer Geometrie festzustellen, können Sie <link linkend="ST_IsSimple">ST_IsSimple()</link> und <link linkend="ST_IsValid">ST_IsValid()</link> verwenden.

source: -- Typically, it doesn't make sense to check -- for validity on linear features since it will always return TRUE. -- But in this example, PostGIS extends the definition of the OGC IsValid -- by returning false if a LineString has less than 2 *distinct* vertices. gisdb=# SELECT ST_IsValid('LINESTRING(0 0, 1 1)'), ST_IsValid('LINESTRING(0 0, 0 0, 0 0)'); st_isvalid | st_isvalid ------------+----------- t | f
de: -- Üblicherweise hat es keinen Sinn lineare Geometrien -- auf Validität zu überprüfen, da immer TRUE zurückgegeben wird. -- Aber in diesem Beispiel erweitert PostGIS die OGC Definition von IsValid -- indem es FALSE zurückgibt, wenn ein LineString weniger als 2 *eindeutige* Stützpunkte aufweist. gisdb=# SELECT ST_IsValid('LINESTRING(0 0, 1 1)'), ST_IsValid('LINESTRING(0 0, 0 0, 0 0)'); st_isvalid | st_isvalid ------------+----------- t | f

source: By default, PostGIS does not apply this validity check on geometry input, because testing for validity needs lots of CPU time for complex geometries, especially polygons. If you do not trust your data sources, you can manually enforce such a check to your tables by adding a check constraint:
de: Standardmäßig überprüft PostGIS eine Geometrieeingabe nicht auf Validität, da Validitätstests von komplexen Geometrien, insbesondere Polygonen, viel CPU Zeit beanspruchen. Fall Sie Ihren Datenquellen nicht trauen, können Sie eine Überprüfung Ihrer Tabellen durch eine "Check Constraint"/Prüfbeschränkung erzwingen:

source: If you encounter any strange error messages such as "GEOS Intersection() threw an error!" when calling PostGIS functions with valid input geometries, you likely found an error in either PostGIS or one of the libraries it uses, and you should contact the PostGIS developers. The same is true if a PostGIS function returns an invalid geometry for valid input.
de: Falls Sie irgendwelche seltsamen Fehlermeldungen, wie "GEOS Intersection() threw an error!" erhalten, obwohl sie eine PostGIS Funktion mit validen Eingabegeometrien aufgerufen haben, ist es wahrscheinlich dass Sie einen Fehler in PostGIS oder einer von PostGIS verwendeten Bibliothek gefunden haben. In diesem Fall sollten Sie das PostGIS Entwicklerteam kontaktieren. Dasselbe gilt, wenn eine PostGIS Funktion auf eine valide Eingabegeometrie eine invalide Geometrie zurückgibt.

source: Strictly compliant OGC geometries cannot have Z or M values. The <link linkend="ST_IsValid">ST_IsValid()</link> function won't consider higher dimensioned geometries invalid! Invocations of <link linkend="AddGeometryColumn">AddGeometryColumn()</link> will add a constraint checking geometry dimensions, so it is enough to specify 2 there.
de: Eine streng konforme OGC-Geometrie hat keine Z- oder M-Werte. Die Funktion <link linkend="ST_IsValid">ST_IsValid()</link> betrachtet höhere geometrische Dimensionen nicht als invalide! Aufrufe von <link linkend="AddGeometryColumn">AddGeometryColumn()</link> fügen einen Check-Constraint für die geometrische Dimension hinzu, weshalb es hier ausreicht 2 anzugeben.

source: Dimensionally Extended 9 Intersection Model (DE-9IM)
de: DE-9IM-Matrix (DE-9IM)

source: It is sometimes the case that the typical spatial predicates (<xref linkend="ST_Intersects"/>, <xref linkend="ST_Contains"/>, <xref linkend="ST_Crosses"/>, <xref linkend="ST_Touches"/>, ...) are insufficient in and of themselves to adequately provide that desired spatial filter.
de: Manchmal kommt es vor, dass die typischen räumlichen Aussagen (<xref linkend="ST_Intersects"/>, <xref linkend="ST_Contains"/>, <xref linkend="ST_Crosses"/>, <xref linkend="ST_Touches"/>, ...) an sich nicht ausreichen, um den verlangten räumlichen Filter auf geeignete Weise zu liefern.

source: For example, consider a linear dataset representing a road network. It may be the task of a GIS analyst to identify all road segments that cross each other, not at a point, but on a line, perhaps invalidating some business rule. In this case, <xref linkend="ST_Crosses"/> does not adequately provide the necessary spatial filter since, for linear features, it returns <varname>true</varname> only where they cross at a point.
de: Betrachten Sie zum Beispiel einen linearen Datensatz, der ein Straßennetz darstellt. Es kann sein, dass ein GIS-Analyst die Aufgabe hat, alle Straßenabschnitte herauszufinden, die sich gegenseitig nicht an einem Punkt sondern entlang einer Linie kreuzen, da dies möglicherweise einer Unternehmensvorschrift widerspricht. In diesem Fall liefert <xref linkend="ST_Crosses"/> nicht den passenden räumlichen Filter, da bei linearen Geoobjekten nur dann <varname>TRUE</varname> zurückgeben wird, wenn sie sich an einem Punkt kreuzen.

source: One two-step solution might be to first perform the actual intersection (<xref linkend="ST_Intersection"/>) of pairs of road segments that spatially intersect (<xref linkend="ST_Intersects"/>), and then compare the intersection's <xref linkend="ST_GeometryType"/> with '<varname>LINESTRING</varname>' (properly dealing with cases that return <varname>GEOMETRYCOLLECTION</varname>s of <varname>[MULTI]POINT</varname>s, <varname>[MULTI]LINESTRING</varname>s, etc.).
de: Eine zweistufige Lösung kann sein, dass man zuerst die eigentliche Verschneidung (<xref linkend="ST_Intersection"/>) von Straßenabschnittspaaren, die sich räumlich überschneiden (<xref linkend="ST_Intersects"/>) ausführt und anschließend den <xref linkend="ST_GeometryType"/> der Verschneidung mit '<varname>LINESTRING</varname>' vergleicht (vermutlich muss man sich mit Fällen auseinandersetzen die <varname>GEOMETRYCOLLECTION</varname>s von <varname>[MULTI]POINT</varname>s, <varname>[MULTI]LINESTRING</varname>s, etc. zurückgeben).

source: A more elegant / faster solution may indeed be desirable.
de: Eine elegantere/schnellere Lösung wäre sicherlich wünschenswert.

source: A second [theoretical] example may be that of a GIS analyst trying to locate all wharfs or docks that intersect a lake's boundary on a line and where only one end of the wharf is up on shore. In other words, where a wharf is within, but not completely within a lake, intersecting the boundary of a lake on a line, and where the wharf's endpoints are both completely within and on the boundary of the lake. The analyst may need to use a combination of spatial predicates to isolate the sought after features:
de: Ein zweites (theoretisches) Beispiel wäre, dass ein GIS-Analyst versucht, alle Anlegestellen oder Kais, welche die Begrenzung eines Sees entlang einer Linie überschneiden und bei denen nur ein Ende der Anlegestelle an der Küste liegt. Anders ausgedrückt, wo ein Kai nicht zur Gänze im See liegt, da er den See entlang einer Linie schneidet und seine Endpunkte sowohl zur Gänze in und auf der Begrenzung des Sees liegen. Dazu kann es nötig sein, dass der Analyst eine Kombination von Aussagen ausführen muss, um die gesuchten Geoobjekte herauszufiltern:

source: ... (needless to say, this could get quite complicated)
de: ... (überflüssig zu erwähnen, das dies ziemlich kompliziert werden kann)

source: So enters the Dimensionally Extended 9 Intersection Model, or DE-9IM for short.
de: Somit stürzen wir uns auf die DE-9IM-Matrix, oder kurz DE-9IM

source: Theory
de: Theorie

source: According to the <ulink url="http://www.opengeospatial.org/standards/sfs">OpenGIS Simple Features Implementation Specification for SQL</ulink>, "the basic approach to comparing two geometries is to make pair-wise tests of the intersections between the Interiors, Boundaries and Exteriors of the two geometries and to classify the relationship between the two geometries based on the entries in the resulting 'intersection' matrix."
de: Gemäß der <ulink url="http://www.opengeospatial.org/standards/sfs">OpenGIS Simple Features Implementation Specification for SQL</ulink>, ist der grundlegende Ansatz für einen Lagevergleich von zwei geometrischen Objekten, die paarweise Überprüfung der Verschneidung des Inneren, der Begrenzung und des Äusseren der beiden geometrischen Objekte und der Einstufung der Beziehung zwischen den beiden geometrischen Objekten an Hand der Einträge in die resultierende 'Verschneidungs'-Matrix.
