Repository: solosciences/configs
Catalog: postgis-3.0.1/doc/po/*/using_postgis_dataman.xml.po
Languages: de

source: -- NAD27 lon/lat SELECT 'SRID=4267;POINT(-123 34)'::geography; geography ---------------------------------------------------- 0101000020AB1000000000000000C05EC00000000000004140 (1 row)
de: -- NAD27 in Länge und Breite SELECT 'SRID=4267;POINT(-123 34)'::geography; geography ---------------------------------------------------- 0101000020AB1000000000000000C05EC00000000000004140 (1 row)

source: -- NAD83 UTM zone meters, yields error since its a meter based projection SELECT 'SRID=26910;POINT(-123 34)'::geography; ERROR: Only lon/lat coordinate systems are supported in geography. LINE 1: SELECT 'SRID=26910;POINT(-123 34)'::geography;
de: -- NAD83 UTM Zone in Meter, resultiert in einem Fehler, da metrische Projektion SELECT 'SRID=26910;POINT(-123 34)'::geography; ERROR: Nur Koordinatensysteme in Länge und Breite werden vom geographischen Datentyp unterstützt. LINE 1: SELECT 'SRID=26910;POINT(-123 34)'::geography;

source: The GEOGRAPHY type calculates the true shortest distance over the sphere between Reykjavik and the great circle flight path between Seattle and London.
de: Mit dem Datentyp GEOGRAPHY wird die wahre, kürzeste Entfernung auf der Kugeloberfläche zwischen Reykjavik und der Flugstrecke entlang des Großkreises von Seattle nach London errechnet.

source: <ulink url="http://gc.kls2.com/cgi-bin/gc?PATH=SEA-LHR">Great Circle mapper</ulink> The GEOMETRY type calculates a meaningless cartesian distance between Reykjavik and the straight line path from Seattle to London plotted on a flat map of the world. The nominal units of the result might be called "degrees", but the result doesn't correspond to any true angular difference between the points, so even calling them "degrees" is inaccurate.
de: <ulink url="http://gc.kls2.com/cgi-bin/gc?PATH=SEA-LHR">Great Circle mapper</ulink> Beim geometrischen Datentyp wird die Entfernung sinnloserweise in einem kartesischen Koordinatensystem zwischen Reykjavik und einer Geraden von Seattle nach London errechnet und auf einer ebenen Weltkarte angezeigt. Dem Namen nach mag das Ergebnis in der Einheit "Grad" angegeben sein, da es aber in keiner Weise irgendeinem wahren Winkel zwischen den Punkten entspricht, ist sogar die Verwendung der Bezeichnung "Grad" falsch.

source: When to use Geography Data type over Geometry data type
de: Wann sollte man den geographischen Datentyp dem geometrischen Datentyp vorziehen

source: The geography type allows you to store data in longitude/latitude coordinates, but at a cost: there are fewer functions defined on GEOGRAPHY than there are on GEOMETRY; those functions that are defined take more CPU time to execute.
de: Der geographische Datentyp speichert die Koordinaten in Form von Länge und Breite. Er hat allerdings den Nachteil, dass für den Datentyp GEOGRAPHY weniger Funktionen zur Verfügung stehen, als für den Datentyp GEOMETRY und diese auch mehr CPU-Zeit beanspruchen.

source: The type you choose should be conditioned on the expected working area of the application you are building. Will your data span the globe or a large continental area, or is it local to a state, county or municipality?
de: Welchen Datentyp Sie wählen, sollte aufgrund der zu erwartenden Flächenausdehnung ihrer Anwendung festgelegt werden. Erstrecken sich Ihre Daten über den gesamten Globus oder über eine große kontinentale Fläche, oder sind sie auf einen Staat, ein Land oder eine Gemeinde beschränkt.

source: If your data is contained in a small area, you might find that choosing an appropriate projection and using GEOMETRY is the best solution, in terms of performance and functionality available.
de: Wenn sich Ihre Daten in einem kleinen Bereich befinden, werden Sie vermutlich eine passende Projektion wählen und den geometrischen Datentyp verwenden, da dies in Bezug auf die Rechenleistung und die verfügbare Funktionalität die bessere Lösung ist.

source: If your data is global or covers a continental region, you may find that GEOGRAPHY allows you to build a system without having to worry about projection details. You store your data in longitude/latitude, and use the functions that have been defined on GEOGRAPHY.
de: Wenn Ihre Daten global sind oder einen ganzen Kontinent bedecken, ermöglicht der geographische Datentyp ein System aufzubauen, bei dem Sie sich nicht um Projektionsdetails kümmern müssen. Sie speichern die Daten als Länge und Breite und verwenden dann jene Funktionen, die für den geographischen Datentyp definiert sind.

source: If you don't understand projections, and you don't want to learn about them, and you're prepared to accept the limitations in functionality available in GEOGRAPHY, then it might be easier for you to use GEOGRAPHY than GEOMETRY. Simply load your data up as longitude/latitude and go from there.
de: Wenn Sie keine Ahnung von Projektionen haben, sich nicht näher damit beschäftigen wollen und die Einschränkungen der verfügbaren Funktionalität für den geographischen Datentyp in Kauf nehmen können, ist es vermutlich einfacher für Sie, den geographischen anstatt des geometrischen Datentyps zu verwenden.

source: Refer to <xref linkend="PostGIS_TypeFunctionMatrix"/> for compare between what is supported for Geography vs. Geometry. For a brief listing and description of Geography functions, refer to <xref linkend="PostGIS_GeographyFunctions"/>
de: Für einen Vergleich, welche Funktionalität von Geography vs. Geometry unterstützt wird, siehe <xref linkend="PostGIS_TypeFunctionMatrix"/>. Für eine kurze Liste mit der Beschreibung der geographischen Funktionen, siehe <xref linkend="PostGIS_GeographyFunctions"/>

source: Geography Advanced FAQ
de: Fortgeschrittene FAQ's zum geographischen Datentyp

source: Do you calculate on the sphere or the spheroid?
de: Werden die Berechnungen auf einer Kugel oder auf einem Rotationsellipsoid durchgeführt?

source: By default, all distance and area calculations are done on the spheroid. You should find that the results of calculations in local areas match up will with local planar results in good local projections. Over larger areas, the spheroidal calculations will be more accurate than any calculation done on a projected plane.
de: Standardmäßig werden alle Entfernungs- und Flächenberechnungen auf dem Referenzellipsoid ausgeführt. Das Ergebnis der Berechnung sollte in lokalen Gebieten gut mit dem planaren Ergebnis zusammenpassen - eine gut gewählte lokale Projektion vorausgesetzt. Bei größeren Gebieten ist die Berechnung über das Referenzellipsoid genauer als eine Berechnung die auf der projizierten Ebene ausgeführt wird.

source: All the geography functions have the option of using a sphere calculation, by setting a final boolean parameter to 'FALSE'. This will somewhat speed up calculations, particularly for cases where the geometries are very simple.
de: Alle geographischen Funktionen verfügen über eine Option um die Berechnung auf einer Kugel durchzuführen. Dies erreicht man, indem der letzte boolesche Eingabewert auf 'FALSE' gesetzt wird. Dies beschleunigt die Berechnung einigermaßen, insbesondere wenn die Geometrie sehr einfach gestaltet ist.

source: What about the date-line and the poles?
de: Wie schaut das mit der Datumsgrenze und den Polen aus?

source: All the calculations have no conception of date-line or poles, the coordinates are spherical (longitude/latitude) so a shape that crosses the dateline is, from a calculation point of view, no different from any other shape.
de: Alle diese Berechnungen wissen weder über Datumsgrenzen noch über Pole Bescheid. Da es sich um sphärische Koordinaten handelt (Länge und Breite), unterscheidet sich eine Geometrie, die eine Datumsgrenze überschreitet vom Gesichtspunkt der Berechnung her nicht von irgendeiner anderen Geometrie.

source: What is the longest arc you can process?
de: Wie lang kann ein Bogen sein, damit er noch verarbeitet werden kann?

source: We use great circle arcs as the "interpolation line" between two points. That means any two points are actually joined up two ways, depending on which direction you travel along the great circle. All our code assumes that the points are joined by the *shorter* of the two paths along the great circle. As a consequence, shapes that have arcs of more than 180 degrees will not be correctly modelled.
de: Wir verwenden Großkreisbögen als "Interpolationslinie" zwischen zwei Punkten. Das bedeutet, dass es für den Join zwischen zwei Punkten zwei Möglichkeiten gibt, je nachdem, aus welcher Richtung man den Großkreis überquert. Unser gesamter Code setzt voraus, dass die Punkte von der "kürzeren" der beiden Strecken her durch den Großkreis verbunden werden. Als Konsequenz wird eine Geometrie, welche Bögen von mehr als 180 Grad aufweist nicht korrekt modelliert.

source: Why is it so slow to calculate the area of Europe / Russia / insert big geographic region here ?
de: Warum dauert es so lange, die Fläche von Europa / Russland / irgendeiner anderen großen geographischen Region zu berechnen?

source: Because the polygon is so darned huge! Big areas are bad for two reasons: their bounds are huge, so the index tends to pull the feature no matter what query you run; the number of vertices is huge, and tests (distance, containment) have to traverse the vertex list at least once and sometimes N times (with N being the number of vertices in the other candidate feature).
de: Weil das Polygon so verdammt groß ist! Große Flächen sind aus zwei Gründen schlecht: ihre Begrenzung ist riesig, wodurch der Index dazu tendiert, das Geoobjekt herauszuholen, egal wie Sie die Anfrage ausführen; die Anzahl der Knoten ist riesig, und Tests (wie ST_Distance, ST_Contains) müssen alle Knoten zumindest einmal, manchmal sogar n-mal durchlaufen (wobei N die Anzahl der Knoten im beteiligten Geoobjekt bezeichnet).

source: As with GEOMETRY, we recommend that when you have very large polygons, but are doing queries in small areas, you "denormalize" your geometric data into smaller chunks so that the index can effectively subquery parts of the object and so queries don't have to pull out the whole object every time. Please consult <xref linkend="ST_Subdivide"/> function documentation. Just because you *can* store all of Europe in one polygon doesn't mean you *should*.
de: Wenn es sich um sehr große Polygone handelt, die Abfragen aber nur in kleinen Gebieten stattfinden, empfehlen wir wie beim geometrischen Datentyp, dass Sie die Geometrie in kleinere Stücke "denormalisieren". Dadurch kann der Index effiziente Unterabfragen auf Teile des Geoobjekts ausführen, da eine Abfrage nicht jedesmal das gesamte Geoobjekt herausholen muss. Konsultieren Sie dazu bitte die Dokumentation der Funktion<xref linkend="ST_Subdivide"/>. Nur weil Sie ganz Europa in einem Polygon speichern *können* heißt das nicht, dass Sie dies auch tun *sollten*.

source: Using OpenGIS Standards
de: Verwendung von OGC-Standards

source: The OpenGIS "Simple Features Specification for SQL" defines standard GIS object types, the functions required to manipulate them, and a set of meta-data tables. In order to ensure that meta-data remain consistent, operations such as creating and removing a spatial column are carried out through special procedures defined by OpenGIS.
de: Die OpenGIS "Simple Features Specification for SQL" standardisert die Datentypen von Geoobjekten, die Funktionen die benötigt werden um diese zu verarbeiten, sowie die Metadatentabellen. Um sicherzustellen, dass die Metadaten konsistent bleiben, werden Vorgänge wie das Erstellen oder das Löschen einer Geometriespalte, durch dafür eigens von OpenGIS festgelegten Prozeduren ausgeführt.

source: There are two OpenGIS meta-data tables: <varname>SPATIAL_REF_SYS</varname> and <varname>GEOMETRY_COLUMNS</varname>. The <varname>SPATIAL_REF_SYS</varname> table holds the numeric IDs and textual descriptions of coordinate systems used in the spatial database.
de: Es gibt zwei OpenGIS Metadatentabellen: <varname>SPATIAL_REF_SYS</varname> und <varname>GEOMETRY_COLUMNS</varname>. Die <varname>SPATIAL_REF_SYS</varname> Tabelle enthält die numerischen Identifikatoren und textlichen Beschreibungen der in der Datenbank verwendeten Koordinatensysteme.

source: The SPATIAL_REF_SYS Table and Spatial Reference Systems
de: Die SPATIAL_REF_SYS Tabelle und Koordinatenreferenzsysteme

source: The spatial_ref_sys table is a PostGIS included and OGC compliant database table that lists over 3000 known <ulink url="http://www.sharpgis.net/post/2007/05/Spatial-references2c-coordinate-systems2c-projections2c-datums2c-ellipsoids-e28093-confusing.aspx">spatial reference systems</ulink> and details needed to transform/reproject between them.
de: Die Tabelle "spatial_ref_sys" ist eine mit PostGIS kommende und OGC-konforme Datenbanktabelle, die über 3000 bekannte <ulink url="http://www.sharpgis.net/post/2007/05/Spatial-references2c-coordinate-systems2c-projections2c-datums2c-ellipsoids-e28093-confusing.aspx">Koordinatenreferenzsysteme</ulink> enthält, sowie Details zur Koordinatentransformation zwischen diesen.

source: Although the PostGIS spatial_ref_sys table contains over 3000 of the more commonly used spatial reference system definitions that can be handled by the proj library, it does not contain all known to man and you can define your own custom projection if you are familiar with proj4 constructs. Keep in mind that most spatial reference systems are regional and have no meaning when used outside of the bounds they were intended for.
de: Obwohl in der PostGIS Tabelle "spatial_ref_sys" über 3000 der gebräuchlichsten Koordinatenreferenzsysteme definiert sind, die mit der Bibliothek "Proj4" gehandhabt werden können, enthält sie nicht alle bekannten Projektionen. Sie können auch ihre eigenen Projektionen in der Tabelle definieren, falls Sie mit den Konstrukten von "Proj4" vertraut sind. Sie sollten nicht außer Acht lassen, dass die meisten Koordinatenreferenzsysteme regional sind und außerhalb des vorgesehenen Bereichs keinen Sinn haben.

source: An excellent resource for finding spatial reference systems not defined in the core set is <ulink url="http://spatialreference.org/">http://spatialreference.org/</ulink>
de: Eine hervorragende Quelle zum Auffinden von Koordinatenreferenzsystemen, welche nicht in der Grundmenge enthalten sind, ist <ulink url="http://spatialreference.org/">http://spatialreference.org/</ulink>

source: Some of the more commonly used spatial reference systems are: <ulink url="http://spatialreference.org/ref/epsg/4326/">4326 - WGS 84 Long Lat</ulink>, <ulink url="http://spatialreference.org/ref/epsg/4269/">4269 - NAD 83 Long Lat</ulink>, <ulink url="http://spatialreference.org/ref/epsg/3395/">3395 - WGS 84 World Mercator</ulink>, <ulink url="http://spatialreference.org/ref/epsg/2163/">2163 - US National Atlas Equal Area</ulink>, Spatial reference systems for each NAD 83, WGS 84 UTM zone - UTM zones are one of the most ideal for measurement, but only cover 6-degree regions.
de: Einige der häufiger eingesetzten Koordinatenreferenzsysteme sind: <ulink url="http://spatialreference.org/ref/epsg/4326/">4326 - WGS 84 Long Lat</ulink>, <ulink url="http://spatialreference.org/ref/epsg/4269/">4269 - NAD 83 Long Lat</ulink>, <ulink url="http://spatialreference.org/ref/epsg/3395/">3395 - WGS 84 World Mercator</ulink>, <ulink url="http://spatialreference.org/ref/epsg/2163/">2163 - US National Atlas Equal Area</ulink>, Koordinatenreferenzsysteme für jede NAD 83, WGS 84 und UTM Zone - UTM Zonen sind ideal für Messungen, decken aber nur 6 Grad breite, vertikale Zonen ab.

source: Various US state plane spatial reference systems (meter or feet based) - usually one or 2 exists per US state. Most of the meter ones are in the core set, but many of the feet based ones or ESRI created ones you will need to pull from <ulink url="http://spatialreference.org">spatialreference.org</ulink>.
de: Verschiedenste Koordinatenreferenzsysteme "US State Plane" (auf Meter und Fuß basierend) - üblicherweise 2 pro US Staat. Die meisten auf Meter basierten befinden sich in der Grundmenge, aber viele der auf Fuß basierten, oder von ESRI erzeugten müssen von <ulink url="http://spatialreference.org">spatialreference.org</ulink> heruntergeladen werden.

source: For details on determining which UTM zone to use for your area of interest, check out the <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiplpgsqlfunctionsDistance">utmzone PostGIS plpgsql helper function</ulink>.
de: Genauere Angaben zur Ermittlung der UTM Zone für ein bestimmtes Gebiet finden Sie unter <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiplpgsqlfunctionsDistance">utmzone PostGIS plpgsql helper function</ulink>.

source: The <varname>SPATIAL_REF_SYS</varname> table definition is as follows:
de: Die <varname>SPATIAL_REF_SYS</varname> Tabelle ist folgendermaßen definiert:

source: The <varname>SPATIAL_REF_SYS</varname> columns are as follows:
de: Die <varname>SPATIAL_REF_SYS</varname> Spalten folgendermaßen:

source: An integer value that uniquely identifies the Spatial Referencing System (SRS) within the database.
de: Ein ganzzahliger Wert, der das Koordinatenreferenzsystem (SRS) innerhalb der Datenbank eindeutig ausweist.

source: The name of the standard or standards body that is being cited for this reference system. For example, "EPSG" would be a valid <varname>AUTH_NAME</varname>.
de: Der Name des Standards oder der Normungsorganisation, unter dem dieses Koordinatenreferenzsystem zitiert wird. Zum Beispiel ist "EPSG" ein gültiger <varname>AUTH_NAME</varname>.

source: The ID of the Spatial Reference System as defined by the Authority cited in the <varname>AUTH_NAME</varname>. In the case of EPSG, this is where the EPSG projection code would go.
de: Die von der in <varname>AUTH_NAME</varname> zitierten Quelle festgelegte ID des Koordinatenreferenzsystems. Im Falle von EPSG ist dies der EPSG Projektionscode.

source: The Well-Known Text representation of the Spatial Reference System. An example of a WKT SRS representation is:
de: Die Well-Known-Text Darstellung des Koordinatenreferenzsystems. Ein Beispiel dazu:

source: For a listing of EPSG projection codes and their corresponding WKT representations, see <ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>. For a discussion of WKT in general, see the OpenGIS "Coordinate Transformation Services Implementation Specification" at <ulink url="http://www.opengeospatial.org/standards">http://www.opengeospatial.org/standards</ulink>. For information on the European Petroleum Survey Group (EPSG) and their database of spatial reference systems, see <ulink url="http://www.epsg.org/">http://www.epsg.org</ulink>.
de: Für eine Auflistung der EPSG Projektionscodes und deren entsprechende WKT Darstellung siehe <ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>. Eine allgemeine Erläuterung zu WKT finden Sie in der OpenGIS "Coordinate Transformation Services Implementation Specification" unter <ulink url="http://www.opengeospatial.org/standards">http://www.opengeospatial.org/standards</ulink>. Information zur European Petroleum Survey Group (EPSG) und deren Datenbank über Koordinatenreferenzsysteme finden Sie unter <ulink url="http://www.epsg.org/">http://www.epsg.org</ulink>.

source: PostGIS uses the Proj4 library to provide coordinate transformation capabilities. The <varname>PROJ4TEXT</varname> column contains the Proj4 coordinate definition string for a particular SRID. For example:
de: PostGIS verwendet die Bibliothek "Proj4" zur Koordinatentransformation. Die Spalte <varname>PROJ4TEXT</varname> enthält eine Proj4 Zeichenfolge mit der Definition des Koordinatensystems für eine bestimmte SRID. Zum Beispiel:

source: For more information about, see the Proj4 web site at <ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>. The <filename>spatial_ref_sys.sql</filename> file contains both <varname>SRTEXT</varname> and <varname>PROJ4TEXT</varname> definitions for all EPSG projections.
de: Weiterführende Information finden Sie auf der Proj4 Webseite unter <ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>. Die Datei <filename>spatial_ref_sys.sql</filename> enthält sowohl <varname>SRTEXT</varname> als auch <varname>PROJ4TEXT</varname> Definitionen aller EPSG Projektionen.

source: The GEOMETRY_COLUMNS VIEW
de: Der View GEOMETRY_COLUMNS

source: <varname>GEOMETRY_COLUMNS</varname> is a view reading from database system catalogs. Its structure is as follows:
de: <varname>GEOMETRY_COLUMNS</varname> ist ein View der den Systemkatalog der Datenbank ausliest. Er hat folgende Struktur:

source: The column meanings are:
de: Die Spalten bedeuten:

source: The fully qualified name of the feature table containing the geometry column. Note that the terms "catalog" and "schema" are Oracle-ish. There is not PostgreSQL analogue of "catalog" so that column is left blank -- for "schema" the PostgreSQL schema name is used (<varname>public</varname> is the default).
de: Der vollständige Name der Tabelle, welche die Geometriespalte enthält. Die Bezeichnungen "catalog" und "schema" kommen von Oracle. Es gibt keine Entsprechung in PostgreSQL für "catalog", weshalb diese Spalte leer bleibt - für "schema" wird der Name des Schemas in PostgreSQL verwendet (standardmäßig <varname>public</varname>).

source: The name of the geometry column in the feature table.
de: Der Name der Geometriespalte in der Feature-Tabelle.

source: The spatial dimension (2, 3 or 4 dimensional) of the column.
de: Die räumliche Dimension (2-, 3- oder 4-dimensional) der Geometriespalte.

source: The ID of the spatial reference system used for the coordinate geometry in this table. It is a foreign key reference to the <varname>SPATIAL_REF_SYS</varname>.
de: Der Identifikator des Koordinatenreferenzsystems, welches für die Geometrie in dieser Tabelle verwendet wird. Dieser ist ein Fremdschlüssel, der sich auf die Tabelle <varname>SPATIAL_REF_SYS</varname> bezieht.

source: The type of the spatial object. To restrict the spatial column to a single type, use one of: POINT, LINESTRING, POLYGON, MULTIPOINT, MULTILINESTRING, MULTIPOLYGON, GEOMETRYCOLLECTION or corresponding XYM versions POINTM, LINESTRINGM, POLYGONM, MULTIPOINTM, MULTILINESTRINGM, MULTIPOLYGONM, GEOMETRYCOLLECTIONM. For heterogeneous (mixed-type) collections, you can use "GEOMETRY" as the type.
de: Der Datentyp des Geoobjekts. Um die räumliche Spalte auf einen einzelnen Datentyp zu beschränken, benutzen Sie bitte: POINT, LINESTRING, POLYGON, MULTIPOINT, MULTILINESTRING, MULTIPOLYGON, GEOMETRYCOLLECTION oder die entsprechenden XYM Versionen POINTM, LINESTRINGM, POLYGONM, MULTIPOINTM, MULTILINESTRINGM, MULTIPOLYGONM und GEOMETRYCOLLECTIONM. Für uneinheitliche Kollektionen (gemischete Datentypen) können Sie den Datentyp "GEOMETRY" verwenden.

source: This attribute is (probably) not part of the OpenGIS specification, but is required for ensuring type homogeneity.
de: Dieses Attribut gehört (wahrscheinlich) nicht zur OpenGIS Spezifikation, wird aber benötigt um homogene Datentypen zu gewährleisten.

source: Creating a Spatial Table
de: Erstellung einer räumlichen Tabelle

source: Creating a table with spatial data, can be done in one step. As shown in the following example which creates a roads table with a 2D linestring geometry column in WGS84 long lat
de: Die Erzeugung einer Tabelle mit räumlichen Daten kann in einem Schritt ausgeführt werden. Dies wird im folgenden Beispiel demonstriert, welches eine Straßentabelle mit einer geometrischen Spalte für 2D Linienzüge in WGS84 Länge/Breite erzeugt
