Repository: solosciences/configs
Catalog: postgis-3.0.1/doc/po/*/using_postgis_dataman.xml.po
Languages: de

source: The boundary of a geometry is the set of geometries of the next lower dimension. For <varname>POINT</varname>s, which have a dimension of 0, the boundary is the empty set. The boundary of a <varname>LINESTRING</varname> are the two endpoints. For <varname>POLYGON</varname>s, the boundary is the linework that make up the exterior and interior rings.
de: Die Begrenzung einer Geometrie ist die geometrische Grundmenge der nächst kleineren Dimension. Bei <varname>POINT</varname>s, die die Dimension 0 haben ist die Begrenzung die leere Menge. Die Begrenzung eines <varname>LINESTRING</varname>s sind die zwei Endpunkte. Bei <varname>POLYGON</varname>en entspricht die Begrenzung jenen Linien, die die äußeren und inneren Ringe zusammensetzen.

source: The interior of a geometry are those points of a geometry that are left when the boundary is removed. For <varname>POINT</varname>s, the interior is the <varname>POINT</varname> itself. The interior of a <varname>LINESTRING</varname> are the set of real points between the endpoints. For <varname>POLYGON</varname>s, the interior is the areal surface inside the polygon.
de: Die Innenseite/interior einer Geometrie besteht aus jenen Punkten einer Geometrie, die zurückbleiben, wenn die Außenbegrenzung/boundary entfernt wird. Bei <varname>POINT</varname>s ist die Innenseite der <varname>POINT</varname> selbst. Die Innenseite eines <varname>LINESTRING</varname>s ist die Menge der echten Punkte zwischen den Endpunkten. Bei <varname>POLYGON</varname>en entspricht die Innenseite der Fläche innerhalb des Polygons.

source: The exterior of a geometry is the universe, an areal surface, not on the interior or boundary of the geometry.
de: Die Außenseite/exterior einer Geometrie ist durch die Grundgesamtheit gegeben. Das ist jene Fläche, die nicht auf der Innenseite/interior oder auf der Begrenzung der Geometrie liegt.

source: Given geometry <emphasis>a</emphasis>, where the <emphasis>I(a)</emphasis>, <emphasis>B(a)</emphasis>, and <emphasis>E(a)</emphasis> are the <emphasis>Interior</emphasis>, <emphasis>Boundary</emphasis>, and <emphasis>Exterior</emphasis> of a, the mathematical representation of the matrix is:
de: Gegeben sei die Geometrie <emphasis>a</emphasis>, wobei <emphasis>I(a)</emphasis>, <emphasis>B(a)</emphasis>, und <emphasis>E(a)</emphasis> das <emphasis>Innere/Interior</emphasis>, die <emphasis>Begrenzung/Boundary</emphasis> und das<emphasis>Äussere/Exterior</emphasis> von a sind; die mathematische Formulierung der Matrix lautet:

source: Where <emphasis>dim(a)</emphasis> is the dimension of <emphasis>a</emphasis> as specified by <xref linkend="ST_Dimension"/> but has the domain of <literal>{0,1,2,T,F,*}</literal>
de: Wobei <emphasis>dim(a)</emphasis>, so wie von <xref linkend="ST_Dimension"/> festgelegt, die Dimension von <emphasis>a</emphasis> ist, aber zu der Domäne von <literal>{0,1,2,T,F,*}</literal> gehört.

source: <literal>F</literal> =&gt; empty set
de: <literal>F</literal> =&gt; Leere Menge

source: <literal>*</literal> =&gt; don't care
de: <literal>*</literal> =&gt; braucht nicht zu kümmern

source: Visually, for two overlapping polygonal geometries, this looks like:
de: Bildlich schaut dies für zwei überlappende Polygongeometrien folgendermaßen aus:

source: Read from left to right and from top to bottom, the dimensional matrix is represented, '<emphasis role="bold">212101212</emphasis>'.
de: Von links nach rechts und von oben nach unten gelesen wird die Dimensionsmatrix durch '<emphasis role="bold">212101212</emphasis>' dargestellt.

source: A relate matrix that would therefore represent our first example of two lines that intersect on a line would be: '<emphasis role="bold">1*1***1**</emphasis>'
de: Eine Beziehungsmatrix, welche das erste Beispiel von zwei Linien, die sich auf einer Linie schneiden, abbildet, würde '<emphasis role="bold">102101FF2</emphasis>' entsprechen.

source: -- Identify road segments that cross on a line SELECT a.id FROM roads a, roads b WHERE a.id != b.id AND a.geom &amp;&amp; b.geom AND ST_Relate(a.geom, b.geom, '1*1***1**');
de: -- Identifizierung der Strassenabschnitte, die eine Linie kreuzen SELECT a.id FROM roads a, roads b WHERE a.id != b.id AND a.geom &amp;&amp; b.geom AND ST_Relate(a.geom, b.geom, '1*1***1**');

source: A relate matrix that represents the second example of wharfs partly on the lake's shoreline would be '<emphasis role="bold">102101FF2</emphasis>'
de: Eine Beziehungsmatrix, welche das zweite Beispiel mit den Kais, die teilweise an der Uferlinie des Sees liegen, abbildet, würde '<emphasis role="bold">102101FF2</emphasis>' entsprechen.

source: -- Identify wharfs partly on a lake's shoreline SELECT a.lake_id, b.wharf_id FROM lakes a, wharfs b WHERE a.geom &amp;&amp; b.geom AND ST_Relate(a.geom, b.geom, '102101FF2');
de: -- Ermittlung von Dämmen, die teilweise an der Uferlinie eines Sees liegen SELECT a.lake_id, b.wharf_id FROM lakes a, wharfs b WHERE a.geom &amp;&amp; b.geom AND ST_Relate(a.geom, b.geom, '102101FF2');

source: For more information or reading, see:
de: Für weiterführende Information siehe:

source: <ulink url="http://www.opengeospatial.org/standards/sfs">OpenGIS Simple Features Implementation Specification for SQL</ulink> (version 1.1, section 2.1.13.2)
de: <ulink url="http://www.opengeospatial.org/standards/sfs">OpenGIS Simple Features Implementation Specification for SQL</ulink> (Version 1.1, Abschnitt 2.1.13.2)

source: Dimensionally Extended Nine-Intersection Model (DE-9IM)
de: DE-9IM-Matrix (DE-9IM)

source: GeoTools: Point Set Theory and the DE-9IM Matrix
de: Geotools: Mengentheoretische Topologie und die DE-9IM-Matrix

source: Loading GIS (Vector) Data
de: GIS (Vektor) Daten laden

source: Once you have created a spatial table, you are ready to upload GIS data to the database. Currently, there are two ways to get data into a PostGIS/PostgreSQL database: using formatted SQL statements or using the Shape file loader/dumper.
de: Sobald Sie eine räumliche Tabelle erstellt haben, können Sie GIS Daten in die Datenbank laden. Zurzeit gibt es zwei Möglichkeiten, Daten in die PostGIS/PostgreSQL Datenbank zu importieren: die Verwendung von formatierten SQL-Anweisungen oder der Shapefile Loader/Dumper.

source: Loading Data Using SQL
de: Daten via SQL laden

source: If you can convert your data to a text representation, then using formatted SQL might be the easiest way to get your data into PostGIS. As with Oracle and other SQL databases, data can be bulk loaded by piping a large text file full of SQL "INSERT" statements into the SQL terminal monitor.
de: Wenn Sie Ihre Daten in eine Textdarstellung konvertieren können, dann ist möglicherweise die Verwendung von formatiertem SQL der leichteste Weg um die Daten in PostGIS zu importieren. Wie bei Oracle und anderen Datenbanken, können die Daten über Masseninserts geladen werden, indem eine große Textdatei, in der sich zahlreiche SQL "INSERT" Anweisungen befinden, an die SQL-Konsole weitergeleitet wird.

source: A data upload file (<filename>roads.sql</filename> for example) might look like this:
de: Eine Importdatei (z.B. <filename>roads.sql</filename>) könnte folgendermaßen aussehen:

source: The data file can be piped into PostgreSQL very easily using the "psql" SQL terminal monitor:
de: Diese Datei kann dann über die "psql" SQL-Konsole sehr leicht nach PostgreSQL weitergeleitet werden:

source: shp2pgsql: Using the ESRI Shapefile Loader
de: shp2pgsql: Verwendung des ESRI-Shapefile Laders

source: The <filename>shp2pgsql</filename> data loader converts ESRI Shape files into SQL suitable for insertion into a PostGIS/PostgreSQL database either in geometry or geography format. The loader has several operating modes distinguished by command line flags:
de: Der <filename>shp2pgsql</filename> Datenlader wandelt ESRI Shapefiles in eine SQL-Datei um, die für das Einfügen in eine PostGIS/PostgreSQL Datenbank mit der "psql"-Konsole, sowohl im Geometrie- als auch im Geographie-Format, geeignet ist. Der Loader besitzt eine Reihe von Betriebsmodi, die durch Flags auf der Befehlszeile ausgewählt werden:

source: In addition to the shp2pgsql command-line loader, there is an <filename>shp2pgsql-gui</filename> graphical interface with most of the options as the command-line loader, but may be easier to use for one-off non-scripted loading or if you are new to PostGIS. It can also be configured as a plugin to PgAdminIII.
de: Zusätzlich zu dem befehlszeilenorientierten Lader "shp2pgsql" gibt es auch die graphische Schnittstelle <filename>shp2pgssql-gui</filename>, welche fast ebensoviele Optionen wie der befehlszeilenorientierte Lader zur Verfügung stellt. Für viele Anwender, die mit der Befehlszeile nicht versiert sind, oder mit PostGIS erst beginnen, ist die GUI möglicherweise einfacher zu bedienen. Sie kann auch in PgAdminIII als Plugin konfiguriert werden.

source: (c|a|d|p) These are mutually exclusive options:
de: (c|a|d|p) Dies sind sich gegenseitig ausschließende Optionen:

source: Creates a new table and populates it from the shapefile. <emphasis>This is the default mode.</emphasis>
de: Erstellt eine neue Tabelle und füllt sie von einem Shapefile her. <emphasis>Dies ist der Standardmodus</emphasis>.

source: Appends data from the Shape file into the database table. Note that to use this option to load multiple files, the files must have the same attributes and same data types.
de: Fügt Daten aus dem Shapefile zu der Datenbanktabelle hinzu. Beachten Sie bitte, falls Sie diese Option verwenden um mehrere Dateien zu laden, dass die Attribute und Datentypen in den Dateien übereinstimmen müssen.

source: Drops the database table before creating a new table with the data in the Shape file.
de: Löscht die Datenbanktabelle, bevor eine neue Tabelle mit den Daten vom Shapefile befüllt wird.

source: Only produces the table creation SQL code, without adding any actual data. This can be used if you need to completely separate the table creation and data loading steps.
de: Erzeugt nur den SQL-Code zur Erstellung der Tabelle, ohne irgendwelche Daten hinzuzufügen. Kann verwendet werden, um die Erstellung und das Laden einer Tabelle vollständig zu trennen.

source: Display help screen.
de: Zeigt die Hilfe an.

source: Use the PostgreSQL "dump" format for the output data. This can be combined with -a, -c and -d. It is much faster to load than the default "insert" SQL format. Use this for very large data sets.
de: Verwendung des PostgreSQL "dump" Formats für die Datenausgabe. Kann mit -a, -c und -d kombiniert werden. Ist wesentlich schneller als das standardmäßige SQL "insert" Format. Verwenden Sie diese Option wenn Sie sehr große Datensätze haben.

source: Keep identifiers' case (column, schema and attributes). Note that attributes in Shapefile are all UPPERCASE.
de: Erhält die Groß- und Kleinschreibung (Spalte, Schema und Attribute). Beachten Sie bitte, dass die Attributnamen in Shapedateien immer Großbuchstaben haben.

source: Coerce all integers to standard 32-bit integers, do not create 64-bit bigints, even if the DBF header signature appears to warrant it.
de: Wandeln Sie alle Ganzzahlen in standard 32-bit Integer um, erzeugen Sie keine 64-bit BigInteger, auch nicht dann wenn der DBF-Header dies unterstellt.

source: Create a GiST index on the geometry column.
de: Einen GIST Index auf die Geometriespalte anlegen.

source: -m <filename>a_file_name</filename> Specify a file containing a set of mappings of (long) column names to 10 character DBF column names. The content of the file is one or more lines of two names separated by white space and no trailing or leading space. For example:
de: -m <filename>a_file_name</filename> bestimmt eine Datei, in welcher die Abbildungen der (langen) Spaltennamen in die 10 Zeichen langen DBF Spaltennamen festgelegt sind. Der Inhalt der Datei besteht aus einer oder mehreren Zeilen die jeweils zwei, durch Leerzeichen getrennte Namen enthalten, aber weder vorne noch hinten mit Leerzeichen versehen werden dürfen. Zum Beispiel:

source: Generate simple geometries instead of MULTI geometries. Will only succeed if all the geometries are actually single (I.E. a MULTIPOLYGON with a single shell, or or a MULTIPOINT with a single vertex).
de: Erzeugt eine Einzel- anstatt einer Mehrfachgeometrie. Ist nur erfolgversprechend, wenn die Geometrie auch tatsächlich eine Einzelgeometrie ist (insbesondere gilt das für ein Mehrfachpolygon/MULTIPOLYGON, dass nur aus einer einzelnen Begrenzung besteht, oder für einen Mehrfachpunkt/MULTIPOINT, der nur einen einzigen Knoten aufweist).

source: Force the output geometry to have the specified dimensionality. Use the following strings to indicate the dimensionality: 2D, 3DZ, 3DM, 4D.
de: Zwingt die Ausgabegeometrie eine bestimmte Dimension anzunehmen. Sie können die folgenden Zeichenfolgen verwenden, um die Dimensionalität anzugeben: 2D, 3DZ, 3DM, 4D.

source: If the input has fewer dimensions that specified, the output will have those dimensions filled in with zeroes. If the input has more dimensions that specified, the unwanted dimensions will be stripped.
de: Wenn die Eingabe weniger Dimensionen aufweist als angegeben, dann werden diese Dimensionen bei der Ausgabe mit Nullen gefüllt. Wenn die Eingabe mehr Dimensionen als angegeben aufweist werden diese abgestreift.

source: Output WKT format, instead of WKB. Note that this can introduce coordinate drifts due to loss of precision.
de: Ausgabe im Format WKT anstatt WKB. Beachten Sie bitte, dass es hierbei zu Koordinatenverschiebungen infolge von Genauigkeitsverlusten kommen kann.

source: Execute each statement on its own, without using a transaction. This allows loading of the majority of good data when there are some bad geometries that generate errors. Note that this cannot be used with the -D flag as the "dump" format always uses a transaction.
de: Jede Anweisung einzeln und nicht in einer Transaktion ausführen. Dies erlaubt den Großteil auch dann zu laden, also die guten Daten, wenn eine Geometrie dabei ist die Fehler verursacht. Beachten Sie bitte das dies nicht gemeinsam mit der -D Flag angegeben werden kann, da das "dump" Format immer eine Transaktion verwendet.

source: Specify encoding of the input data (dbf file). When used, all attributes of the dbf are converted from the specified encoding to UTF8. The resulting SQL output will contain a <code>SET CLIENT_ENCODING to UTF8</code> command, so that the backend will be able to reconvert from UTF8 to whatever encoding the database is configured to use internally.
de: Gibt die Codierung der Eingabedaten (dbf-Datei) an. Wird die Option verwendet, so werden alle Attribute der dbf-Datei von der angegebenen Codierung nach UTF8 konvertiert. Die resultierende SQL-Ausgabe enthält dann den Befehl <code>SET CLIENT_ENCODING to UTF8</code>, damit das Back-end wiederum die Möglichkeit hat, von UTF8 in die, für die interne Nutzung konfigurierte Datenbankcodierung zu decodieren.

source: NULL geometries handling policy (insert*,skip,abort)
de: Umgang mit NULL-Geometrien (insert*, skip, abort)

source: -n Only import DBF file. If your data has no corresponding shapefile, it will automatically switch to this mode and load just the dbf. So setting this flag is only needed if you have a full shapefile set, and you only want the attribute data and no geometry.
de: -n Es wird nur die *.dbf-Datei importiert. Wenn das Shapefile nicht Ihren Daten entspricht, wird automatisch auf diesen Modus geschaltet und nur die *.dbf-Datei geladen. Daher müssen Sie diese Flag nur dann setzen, wenn sie einen vollständigen Shapefile-Satz haben und lediglich die Attributdaten, und nicht die Geometrie, laden wollen.

source: Use geography type instead of geometry (requires lon/lat data) in WGS84 long lat (SRID=4326)
de: Verwendung des geographischen Datentyps in WGS84 (SRID=4326), anstelle des geometrischen Datentyps (benötigt Längen- und Breitenangaben).

source: Specify the tablespace for the new table. Indexes will still use the default tablespace unless the -X parameter is also used. The PostgreSQL documentation has a good description on when to use custom tablespaces.
de: Den Tablespace für die neue Tabelle festlegen. Solange der -X Parameter nicht angegeben wird, benutzen die Indizes weiterhin den standardmäßig festgelegten Tablespace. Die PostgreSQL Dokumentation beinhaltet eine gute Beschreibung, wann es sinnvoll ist, eigene Tablespaces zu verwenden.

source: Specify the tablespace for the new table's indexes. This applies to the primary key index, and the GIST spatial index if -I is also used.
de: Den Tablespace bestimmen, in dem die neuen Tabellenindizes angelegt werden sollen. Gilt für den Primärschlüsselindex und wenn "-l" verwendet wird, auch für den räumlichen GIST-Index.

source: An example session using the loader to create an input file and uploading it might look like this:
de: Eine beispielhafte Sitzung, in welcher der Loader verwendet wird, um eine Eingabedatei zu erzeugen und anschließend hochzuladen, könnte folgendermaßen aussehen:

source: A conversion and upload can be done all in one step using UNIX pipes:
de: Konvertierung und Import können über UNIX-Pipes in einem Schritt erfolgen:

source: Retrieving GIS Data
de: Geodaten abrufen

source: Data can be extracted from the database using either SQL or the Shape file loader/dumper. In the section on SQL we will discuss some of the operators available to do comparisons and queries on spatial tables.
de: Daten können entweder über SQL oder mit dem Shapefile Loader/Dumper aus der Datenbank entnommen werden. Im Abschnitt über SQL werden einige Operatoren besprochen, die für Vergleiche und Abfragen von Geotabellen zur Verfügung stehen.

source: Using SQL to Retrieve Data
de: Daten mit SQL abrufen

source: The most straightforward means of pulling data out of the database is to use a SQL select query to reduce the number of RECORDS and COLUMNS returned and dump the resulting columns into a parsable text file:
de: Die direkteste Methode, um Daten aus der Datenbank abzurufen, ist eine SQL Select-Anfrage. Dadurch kann die Anzahl der resultierenden Datensätze und Attribute reduziert und in eine lesbare Textdatei überspielt werden:

source: However, there will be times when some kind of restriction is necessary to cut down the number of fields returned. In the case of attribute-based restrictions, just use the same SQL syntax as normal with a non-spatial table. In the case of spatial restrictions, the following operators are available/useful:
de: Wie auch immer, manchmal wird eine Einschränkung notwendig sein, um die Anzahl der zurückgegebenen Werte zu reduzieren. Falls es sich um eine Beschränkung auf ein Attribut handelt, können Sie dieselbe SQL-Syntax verwenden wie bei jeder anderen Nicht-Geometrietabelle. Für räumliche Beschränkungen sind folgende Operatoren verfügbar/nützlich:

source: This function tells whether two geometries share any space.
de: Diese Funktion bestimmt ob sich zwei geometrische Objekte einen gemeinsamen Raum teilen

source: This tests whether two geometries are geometrically identical. For example, if 'POLYGON((0 0,1 1,1 0,0 0))' is the same as 'POLYGON((0 0,1 1,1 0,0 0))' (it is).
de: Überprüft, ob zwei Geoobjekte geometrisch ident sind. Zum Beispiel, ob 'POLYGON((0 0,1 1,1 0,0 0))' ident mit 'POLYGON((0 0,1 1,1 0,0 0))' ist (ist es).

source: Note: before PostGIS 2.4 this compared only boxes of geometries.
de: Beachte: vor PostGIS 2.4 wuden nur die umschreibenden Rechtecke der Geometrie verglichen.

source: Next, you can use these operators in queries. Note that when specifying geometries and boxes on the SQL command line, you must explicitly turn the string representations into geometries function. The 312 is a fictitious spatial reference system that matches our data. So, for example:
de: Außerdem können Sie diese Operatoren in Anfragen verwenden. Beachten Sie bitte, wenn Sie eine Geometrie oder eine Box auf der SQL-Befehlszeile eingeben, dass Sie die Zeichensatzdarstellung explizit in eine Geometrie umwandeln müssen. 312 ist ein fiktives Koordinatenreferenzsystem das zu unseren Daten passt. Also, zum Beispiel:

source: The above query would return the single record from the "ROADS_GEOM" table in which the geometry was equal to that value.
de: Die obere Abfrage würde einen einzelnen Datensatz aus der Tabelle "ROADS_GEOM" zurückgeben, in dem die Geometrie gleich dem angegebenen Wert ist.

source: To check whether some of the roads passes in the area defined by a polygon:
de: Überprüfung ob einige der Strassen in die Polygonfläche hineinreichen:

source: The most common spatial query will probably be a "frame-based" query, used by client software, like data browsers and web mappers, to grab a "map frame" worth of data for display.
de: Die häufigsten räumlichen Abfragen werden vermutlich in einem bestimmten Ausschnitt ausgeführt. Insbesondere von Client-Software, wie Datenbrowsern und Kartendiensten, die auf diese Weise die Daten für die Darstellung eines "Kartenausschnitts" erfassen.

source: When using the "&amp;&amp;" operator, you can specify either a BOX3D as the comparison feature or a GEOMETRY. When you specify a GEOMETRY, however, its bounding box will be used for the comparison.
de: Der Operator "&amp;&amp;" kann entweder mit einer BOX3D oder mit einer Geometrie verwendet werden. Allerdings wird auch bei einer Geometrie nur das Umgebungsrechteck für den Vergleich herangezogen.

source: Using a "BOX3D" object for the frame, such a query looks like this:
de: Die Abfrage zur Verwendung des "BOX3D" Objekts für einen solchen Ausschnitt sieht folgendermaßen aus:

source: Note the use of the SRID 312, to specify the projection of the envelope.
de: Achten Sie auf die Verwendung von SRID=312, welche die Projektion Einhüllenden/Enveloppe bestimmt.

source: Using the Dumper
de: Verwendung des Dumper

source: The <filename>pgsql2shp</filename> table dumper connects directly to the database and converts a table (possibly defined by a query) into a shape file. The basic syntax is:
de: Der Tabellendumper <filename>pgsql2shp</filename> verbindet sich direkt mit der Datenbank und konvertiert eine Tabelle (evtl. durch eine Abfrage festgelegt) in eine Shapedatei. Die grundlegende Syntax lautet:

source: The commandline options are:
de: Optionen auf der Befehlszeile:

source: Write the output to a particular filename.
de: Ausgabe in eine bestimmte Datei.

source: The database host to connect to.
de: Der Datenbankserver, mit dem eine Verbindung aufgebaut werden soll.

source: The port to connect to on the database host.
de: Der Port über den der Verbindungsaufbau mit dem Datenbank Server hergestellt werden soll.

source: The password to use when connecting to the database.
de: Das Passwort, das zum Verbindungsaufbau mit der Datenbank verwendet werden soll.

source: The username to use when connecting to the database.
de: Das Benutzername, der zum Verbindungsaufbau mit der Datenbank verwendet werden soll.

source: In the case of tables with multiple geometry columns, the geometry column to use when writing the shape file.
de: Bei Tabellen mit mehreren Geometriespalten jene Geometriespalte, die ins Shapefile geschrieben werden soll.

source: Use a binary cursor. This will make the operation faster, but will not work if any NON-geometry attribute in the table lacks a cast to text.
de: Die Verwendung eines binären Cursors macht die Berechnung schneller; funktioniert aber nur, wenn alle nicht-geometrischen Attribute in den Datentyp "text" umgewandelt werden können.

source: Raw mode. Do not drop the <varname>gid</varname> field, or escape column names.
de: RAW-Modus. Das Attribut <varname>gid</varname> wird nicht verworfen und Spaltennamen werden nicht maskiert.
