Repository: solosciences/configs
Catalog: postgis-3.0.1/doc/po/*/using_postgis_dataman.xml.po
Languages: de

source: If your reason is because you are modeling something that doesn't have a geographic spatial reference system defined such as the internals of a molecule or the floorplan of a not yet built amusement park then that's fine. If the location of the amusement park has been planned however, then it would make sense to use a suitable planar coordinate system for that location if nothing more than to ensure the amusement part is not trespassing on already existing structures.
de: Wenn der Grund darin liegt, dass Sie etwas modellieren, für dass kein Koordinatenreferenzsystem festgelegt ist, wie der innere Aufbau eines Moleküls oder der Grundriss eines noch nicht gebauten Vergnügungsparks, so ist dies in Ordnung. Wenn der Standort des Vergnügungsparks bereits geplant wurde, dann ist die Wahl eines geeigneten Koordinatenreferenzsystems sinnvoll, auch wenn es nur darum geht sicherzustellen, dass der Vergnügungspark keine bereits bestehenden Strukturen überdeckt.

source: Even in the case where you are planning a Mars expedition to transport the human race in the event of a nuclear holocaust and you want to map out the Mars planet for rehabitation, you can use a non-earthly coordinate system such as <ulink url="http://spatialreference.org/ref/iau2000/mars-2000/">Mars 2000</ulink> make one up and insert it in the <varname>spatial_ref_sys</varname> table. Though this Mars coordinate system is a non-planar one (it's in degrees spheroidal), you can use it with the geography type to have your length and proximity measurements in meters instead of degrees.
de: Sogar wenn Sie eine Mars Expedition planen, um die menschliche Rasse nach einem nuklearen Holocaust zu transportieren und Sie den Planeten Mars für die Besiedelung kartieren wollen, können Sie ein Koordinatenreferenzsystem wie <ulink url="http://spatialreference.org/ref/iau2000/mars-2000/">Mars 2000</ulink> erstellen und dieses in die Tabelle <varname>spatial_ref_sys</varname> einfügen. Obwohl dieses Koordinatensystem für den Mars nicht planar ist (es ist in Grad des Referenzellipsoids), können Sie den geographischen Datentyp nutzen, um Längen- und Abstandsmessungen in Meter anstatt in Grad anzuzeigen.

source: Taking Advantage of Indexes
de: Vorteile von Indizes nutzen

source: When constructing a query it is important to remember that only the bounding-box-based operators such as &amp;&amp; can take advantage of the GiST spatial index. Functions such as <varname>ST_Distance()</varname> cannot use the index to optimize their operation. For example, the following query would be quite slow on a large table:
de: Wenn Sie eine Abfrage erstellen, müssen Sie beachten, dass nur die auf den umschreibenden Rechtecken basierenden Operatoren wie &amp;&amp; die Vorteile eines räumlichen GIST Index ausnutzen können. Funktionen wie <varname>ST_Distance()</varname> können den Index nicht zur Optimierung heranziehen. Zum Beispiel würde die folgende Abfrage auf eine große Tabelle ziemlich langsam ablaufen:

source: This query is selecting all the geometries in geom_table which are within 100 units of the point (100000, 200000). It will be slow because it is calculating the distance between each point in the table and our specified point, ie. one <varname>ST_Distance()</varname> calculation for each row in the table. We can avoid this by using the single step index accelerated function ST_DWithin to reduce the number of distance calculations required:
de: Diese Abfrage wählt die geometrischen Objekte der Tabelle "geom_table" aus, die weniger als 100 Einheiten von dem Punkt (100000, 200000) entfernt liegen. Sie ist sehr langsam, da die Entfernung zwischen jedem Punkt in der Tabelle und dem gegebenen Punkt berechnet werden muss, d.h. eine <varname>ST_Distance()</varname> Berechnung pro Tabellenzeile. Wir können dies vermeiden, indem wir die indexbeschleunigte Einstufenfunktion ST_DWithin verwenden und so die Anzahl der benötigten Entfernungsberechnungen verringern:

source: This query selects the same geometries, but it does it in a more efficient way. Assuming there is a GiST index on the_geom, the query planner will recognize that it can use the index to reduce the number of rows before calculating the result of the <varname>ST_Distance()</varname> function. Notice that the <varname>ST_MakeEnvelope</varname> geometry which is used in the &amp;&amp; operation is a 200 unit square box centered on the original point - this is our "query box". The &amp;&amp; operator uses the index to quickly reduce the result set down to only those geometries which have bounding boxes that overlap the "query box". Assuming that our query box is much smaller than the extents of the entire geometry table, this will drastically reduce the number of distance calculations that need to be done.
de: Diese Anfrage wählt dieselben geometrischen Objekte aus, allerdings auf effizientere Weise. Angenommen es existiert ein GIST Index auf der Spalte "the_geom" und der Anfrageoptimierer erkennt, dass der Index angewendet werden kann, um die Zeilenanzahl zu verringern, bevor das Ergebnis durch die Funktion <varname>ST_Distance()</varname> errechnet wird. Anmerkung: die Geometrie <varname>ST_MakeEnvelope</varname>, die vom Operator "&amp;&amp;" verwendet wird, ist ein Quadrat mit einer Seitenlänge von 200 Einheiten, dessen Mittelpunkt auf dem ursprünglichen Punkt liegt - dies ist unsere "Abfrage Box". Der Operator "&amp;&amp;" verwendet diesen Index, um die Ergebnismenge rasch auf die Geometrie zu reduzieren, deren Umgebungsrechtecke die "Abfrage Box" überlagern. Falls Unsere "Abfrage Box" wesentlich kleiner als die Gesamtausdehnung der gesamten Geometrietabelle ist, wird dadurch die Anzahl der Entfernungsberechnungen drastisch verringert- dies ist genau das, was wir wollen.

source: Examples of Spatial SQL
de: Beispiele für Spatial SQL

source: The examples in this section will make use of two tables, a table of linear roads, and a table of polygonal municipality boundaries. The table definitions for the <varname>bc_roads</varname> table is:
de: Die Beispiele in diesem Abschnitt verwenden zwei Tabellen, eine Tabelle mit linearen Straßen, und eine Tabelle mit polygonalen Verwaltungsgrenzen. Die Tabellendefinition der Tabelle <varname>bc_roads</varname> lautet:

source: The table definition for the <varname>bc_municipality</varname> table is:
de: Die Tabellendefinition für die Tabelle <varname>bc_municipality</varname> lautet:

source: What is the total length of all roads, expressed in kilometers?
de: Gesamtlänge aller Straßen in Kilometer?

source: You can answer this question with a very simple piece of SQL:
de: Sie können diese Frage mit einer sehr einfachen SQL Anweisung beantworten:

source: How large is the city of Prince George, in hectares?
de: Wieviele Hektar hat die Stadt Prince George?

source: This query combines an attribute condition (on the municipality name) with a spatial calculation (of the area):
de: Diese Abfrage kombiniert eine Attributbedingung (auf den Gemeindenamen) mit einer räumlichen Berechnung (der Fläche):

source: What is the largest municipality in the province, by area?
de: Welche ist die flächengrößte Gemeinde der Provinz?

source: This query brings a spatial measurement into the query condition. There are several ways of approaching this problem, but the most efficient is below:
de: Diese Abfrage verwendet eine räumliche Messung als Abfragefilter. Es gibt verschiedene Wege dieses Problem anzugehen, aber die effizienteste Methode ist folgende:

source: Note that in order to answer this query we have to calculate the area of every polygon. If we were doing this a lot it would make sense to add an area column to the table that we could separately index for performance. By ordering the results in a descending direction, and them using the PostgreSQL "LIMIT" command we can easily pick off the largest value without using an aggregate function like max().
de: Um diese Anfrage zu beantworten, müssen wir die Fläche eines jeden Polygons berechnen. Wenn wir dies oft machen müssen, kann es aufgrund der Rechenleistung sinnvoll sein, eine eigene Flächenspalte an die Tabelle anzuhängen und mit einem Index zu versehen. Indem wir das Ergebnis in absteigender Reihenfolge sortieren und den PostgreSQL Befehl "LIMIT" einsetzen, können wir die größten Werte herausfiltern, ohne eine Aggregatfunktion wie max() verwenden zu müssen.

source: What is the length of roads fully contained within each municipality?
de: Welche Länge haben die Straßen, die zur Gänze innerhalb einer Gemeinde liegen?

source: This is an example of a "spatial join", because we are bringing together data from two tables (doing a join) but using a spatial interaction condition ("contained") as the join condition rather than the usual relational approach of joining on a common key:
de: Dies ist ein Beispiel für einen "Spatial Join", da wir die Daten aus zwei Tabellen zusammenführen (einen Join ausführen) und als Join-Bedingung eine räumliche Interaktion ("contained") verwenden - anstelle des üblichen relationalen Ansatzes bei dem die Tabellen über einen gemeinsamen Schlüssel verknüpft werden:

source: This query takes a while, because every road in the table is summarized into the final result (about 250K roads for our particular example table). For smaller overlays (several thousand records on several hundred) the response can be very fast.
de: Diese Abfrage dauert ein Weilchen, da sämtliche Straßen in der Tabelle in das endgültige Ergebnis aufsummiert werden müssen (über 250k Straßen in Unserem speziellen Beispiel). Bei kleineren Überlagerungen (ein paar tausend Datensätze auf ein paar Hundert) kann die Antwort sehr schnell zurückkommen.

source: Create a new table with all the roads within the city of Prince George.
de: Eine neue Tabelle erzeugen, die alle Straßen der Stadt Prince George beinhaltet.

source: This is an example of an "overlay", which takes in two tables and outputs a new table that consists of spatially clipped or cut resultants. Unlike the "spatial join" demonstrated above, this query actually creates new geometries. An overlay is like a turbo-charged spatial join, and is useful for more exact analysis work:
de: Dies ist ein Beispiel für ein "Overlay", das zwei Tabellen entgegennimmt und eine neue Tabelle ausgibt, welche die aus- und abgeschnittene Ergebnisgeometrie enthält. Anders als bei dem oben gezeigten "Spatial Join" erzeugt diese Abfrage eine neue Geometrie. Ein "Overlay" ist wie ein "Spatial Join" mit Turbolader und wird für genauere Analysen verwendet:

source: What is the length in kilometers of "Douglas St" in Victoria?
de: Wie lange ist die "Douglas St" in Victoria in Kilometern?

source: What is the largest municipality polygon that has a hole?
de: Welches ist das größte Gemeindepolygon mit einer Lücke?
