Repository: solosciences/configs
Catalog: postgis-3.0.1/doc/po/*/using_postgis_dataman.xml.po
Languages: de

source: Remap identifiers to ten character names. The content of the file is lines of two symbols separated by a single white space and no trailing or leading space: VERYLONGSYMBOL SHORTONE ANOTHERVERYLONGSYMBOL SHORTER etc.
de: Bildet die Identifikatoren in Namen mit 10 Zeichen ab. Der Inhalt der Datei besteht aus Zeilen von jeweils zwei durch Leerzeichen getrennten Symbolen, jedoch ohne vor- oder nachgestellte Leerzeichen: VERYLONGSYMBOL SHORTONE ANOTHERVERYLONGSYMBOL SHORTER etc.

source: Building Indexes
de: Erstellung von Indizes

source: Indexes are what make using a spatial database for large data sets possible. Without indexing, any search for a feature would require a "sequential scan" of every record in the database. Indexing speeds up searching by organizing the data into a search tree which can be quickly traversed to find a particular record. PostgreSQL supports three kinds of indexes by default: B-Tree indexes, SP-GiST and GiST indexes.
de: Indizes ermöglichen das Arbeiten mit großen Datensätzen in einer Geodatenbank. Ohne Indizierung würde jede Featureanfrage einen "Full Table Scan" in der Datenbank benötigen. Die Indizierung beschleunigt die Suche, indem die Daten in einem Suchbaum strukturiert werden, der dann schnell durchlaufen werden kann um einen bestimmten Datensatz zu finden. PostgreSQL unterstützt standardmäßig drei Arten von Indizes: B-Baum, SP-GIST und GIST.

source: B-Trees are used for data which can be sorted along one axis; for example, numbers, letters, dates. Spatial data can be sorted along a space-filling curve, Z-order curve or Hilbert curve. This representation however does not allow speeding up common operations.
de: Ein B-Baum wird verwendet, wenn die Daten entlang einer Achse sortiert werden können; wie Zahlen, Buchstaben oder Datumsangaben. Geodaten können entlang einer raumfüllenden Kurve, Z-Kurve oder Hilbert-Kurve sortiert werden. Diese Darstellung erlaubt allerdings keine Beschleunigung der üblichen Operationen.

source: GiST (Generalized Search Trees) indexes break up data into "things to one side", "things which overlap", "things which are inside" and can be used on a wide range of data-types, including GIS data. PostGIS uses an R-Tree index implemented on top of GiST to index GIS data.
de: GiST (Generalized Search Tree) Indizes unterteilen die Daten in "Dinge auf einer Seite", "Dinge die sich überlagern", "Dinge die innerhalb liegen". Sie können auf eine Vielzahl von Datentypen, inklusive Geodaten angewendet werden. Um Geodaten zu indizieren verwendet PostGIS einen R-Baum der auf dem GIST Index aufsetzt.

source: GiST Indexes
de: GiST-Indizes

source: GiST stands for "Generalized Search Tree" and is a generic form of indexing. In addition to GIS indexing, GiST is used to speed up searches on all kinds of irregular data structures (integer arrays, spectral data, etc) which are not amenable to normal B-Tree indexing.
de: GIST (Generalized Search Tree) ist eine generische Datenstruktur. Zusätzlich zur Indizierung von Geodaten wird GIST auch zur Beschleunigung von Abfragen auf unregelmäßige Datenstrukturen (Ganzzahl-Felder, Spektraldaten, etc.) verwendet, welche über gewöhnlicher B-Baum Indizierung nicht zugänglich sind.

source: Once a GIS data table exceeds a few thousand rows, you will want to build an index to speed up spatial searches of the data (unless all your searches are based on attributes, in which case you'll want to build a normal index on the attribute fields).
de: Sobald eine Geodatentabelle einige tausend Zeilen überschreitet, werden Sie einen Index erzeugen wollen, um die räumlichen Abfragen auf die Daten zu beschleunigen (außer Ihre Suche basiert lediglich auf Attributen, in diesem Fall werden Sie einen gewöhnlichen Index auf die Attribute setzen).

source: The syntax for building a GiST index on a "geometry" column is as follows:
de: Die Syntax, mit der ein GIST-Index auf eine Geometriespalte gelegt wird, lautet:

source: The above syntax will always build a 2D-index. To get the an n-dimensional index for the geometry type, you can create one using this syntax:
de: Die obere Syntax erzeugt immer einen 2D-Index. Um einen n-dimensionalen Index für den geometrischen Datentyp zu erhalten, können Sie die folgende Syntax verwenden:

source: Building a spatial index is a computationally intensive exercise. It also blocks write access to your table for the time it creates, so on a production system you may want to do in in a slower CONCURRENTLY-aware way:
de: Die Erstellung eines räumlichen Indizes ist eine rechenintensive Aufgabe. Während der Erstellung wird auch der Schreibzugriff auf die Tabelle blockiert. Bei produktiven Systemen empfiehlt sich daher die langsamere Option CONCURRENTLY:

source: After building an index, it is sometimes helpful to force PostgreSQL to collect table statistics, which are used to optimize query plans:
de: Nachdem ein Index aufgebaut wurde sollte PostgreSQL gezwungen werden die Tabellenstatistik zu sammeln, da diese zur Optmierung der Auswertungspläne verwendet wird:

source: BRIN Indexes
de: BRIN Indizes

source: BRIN stands for "Block Range Index" and is a generic form of indexing that has been introduced in PostgreSQL 9.5. BRIN is a lossy kind of index, and its main usage is to provide a compromise for both read and write performance. Its primary goal is to handle very large tables for which some of the columns have some natural correlation with their physical location within the table. In addition to GIS indexing, BRIN is used to speed up searches on various kinds of regular or irregular data structures (integer, arrays etc).
de: Die Bezeichnung BRIN steht für "Block Range Index", eine generische Form des Indizierens und wurde mit PostgreSQL 9.5 eingeführt. BRIN ist ein verlustbehafteter Index, dessen Hauptzweck ist, einen Kompromiss sowohl bei der Lese- als auch bei der Schreibgeschwindigkeit anzubieten. Der Hauptverwendungszweck liegt bei sehr großen Tabellen, in denen einige Spalten einen natürlichen Bezug zu dem physischen Speicherplatz innerhalb der Tabelle haben. Zusätzlich zur Indizierung von GIS-Daten, werden BRIN-Indizes zur Beschleunigung von Suchabfragen auf unterschiedliche regelmäßige und unregelmäßige Datenstrukturen (Ganzzahlen, Felder etc.) verwendet.

source: Once a GIS data table exceeds a few thousand rows, you will want to build an index to speed up spatial searches of the data (unless all your searches are based on attributes, in which case you'll want to build a normal index on the attribute fields). GiST indexes are really performant as long as their size doesn't exceed the amount of RAM available for the database, and as long as you can afford the storage size, and the penalty in write workload. Otherwise, BRIN index can be considered as an alternative.
de: Sobald eine Geodatentabelle ein paar tausend Zeilen überschreitet, werden Sie einen Index erzeugen wollen, um die räumlichen Abfragen auf die Daten zu beschleunigen (außer Ihre Suche basiert lediglich auf Attributen, in diesem Fall werden Sie einen gewöhnlichen Index auf die Attribute setzen). GIST Indizes sind sehr performant, solange ihre Dateigröße den verfügbaren Arbeitsspeicher der Datenbank nicht überschreitet, genügend Festplattenspeicher vorhanden ist und die Systembelastung durch Schreibvorgänge akzeptiert werden kann. Andernfalls bietet der BRIN Index eine Alternative.

source: The idea of a BRIN index is to store only the bouding box englobing all the geometries contained in all the rows in a set of table blocks, called a range. Obviously, this indexing method will only be efficient if the data is physically ordered in a way where the resulting bouding boxes for block ranges will be mutually exclusive. The resulting index will be really small, but will be less efficient than a GiST index in many cases.
de: Die Idee hinter einem BRIN-Index ist, dass nur das Umgebungsrechteck abgespeichert wird, dass die gesamte Geometrie eines oder mehrerer Tabellenblöcke umschließt; dies wird als "Range" bezeichnet. Es ist klar, dass diese Indizierungsmethode nur dann effizient sein kann, wenn die Daten physikalisch so angeordnet sind, dass sich die resultierenden Umgebungsrechtecke der "Block Ranges" gegenseitig ausschließen. Der resultierende Index ist zwar sehr klein, in vielen Fällen allerdings weniger effizient als ein GIST Index.

source: Building a BRIN index is way less intensive than building a GiST index. It's quite common to build a BRIN index in more than ten time less than a GiST index would have required. As a BRIN index only store one bouding box for one to many table blocks, it's pretty common to consume up to a thousand time less disk space for this kind of indexes.
de: Die Erstellung eines BRIN-Index benötigt wesentlich weniger Zeit, als die Erstellung eines GIST-Index. Es ist durchaus üblich, dass die Erstellung des BRIN Index mehr als zehnmal so schnell ist, als die eines GIST Index. Da ein BRIN Index nur ein Umgebungsrechteck für einen oder mehrere Tabellenblöcke speichert, benötigt dieser oft bis zu tausendmal weniger Festplattenspeicher.

source: You can choose the number of blocks to summarize in a range. If you decrease this number, the index will be bigger but will probably help to get better performance.
de: Sie können die Anzahl der Blöcke festlegen, die zu einen "Range" aufsummiert werden sollen. Wenn Sie die Anzahl verringern, wird der Index zwar größer, höchstwahrscheinlich aber zu einer besseren Performanz verhelfen.

source: The syntax for building a BRIN index on a "geometry" column is as follows:
de: Der Syntax zur Erstellung eines BRIN-Indizes auf eine geometrische Spalte lautet wie folgt:

source: The above syntax will always build a 2D-index. To get a 3D-dimensional index, you can create one using this syntax
de: Die obere Syntax erzeugt einen 2D-Index. Um einen 3-dimensionalen Index zu erhalten, können Sie die folgende Syntax verwenden:

source: You can also get a 4D-dimensional index using the 4D operator class
de: Sie können auch einen 4-dimensionalen Index über die 4D-Operatorklasse erstellen

source: These above syntaxes will use the default number or block in a range, which is 128. To specify the number of blocks you want to summarise in a range, you can create one using this syntax
de: Die oberen Syntaxen verwenden die Standardeinstellung für die Anzahl der Blöcke in einem "Range", nämlich 128. Wenn Sie die Anzahl der Blöcke, die in einem Range zusammengefasst werden sollen, selbst festlegen wollen, verwenden Sie bitte die folgende Syntax

source: Also, keep in mind that a BRIN index will only store one index value for a large number of rows. If your table stores geometries with a mixed number of dimensions, it's likely that the resulting index will have poor performance. You can avoid this drop of performance by choosing the operator class whith the least number of dimensions of the stored geometries
de: Beachten Sie bitte auch, dass ein BRIN Index nur einen Indexwert für eine große Anzahl von Zeilen speichert. Wenn Ihre Tabelle eine Geometrie mit unterschiedlichen Dimensionen speichert, dann ist es wahrscheinlich dass der Index eine schlechte Performanz aufweist. Sie können diesen Performanzrückgang vermeiden, indem Sie die Operatorklasse mit der niedrigsten Dimension der gespeicherten Geometrie wählen.

source: Also the "geography" datatype is supported for BRIN indexing. The syntax for building a BRIN index on a "geography" column is as follows:
de: Der BRIN-Index wird auch vom geographischen Datentyp unterstützt. Die Syntax zur Erstellung eines BRIN-Index auf eine "geographische" Spalte lautet wie folgt:

source: The above syntax will always build a 2D-index for geospatial objects on the spheroid.
de: Die obere Syntax erzeugt den 2D-Index für Geoobjekte auf dem Referenzellipsoid.

source: Currently, just the "inclusion support" is considered here, meaning that just <varname>&amp;&amp;</varname>, <varname>~</varname> and <varname>@</varname> operators can be used for the 2D cases (both for "geometry" and for "geography"), and just the <varname>&amp;&amp;&amp;</varname> operator can be used for the 3D geometries. There is no support for kNN searches at the moment.
de: Aktuell wird hierbei nur die "Inklusionsunterstützung" betrachtet; d.h. dass nur die Operatoren <varname>&amp;&amp;</varname>, <varname>~</varname> und <varname>@</varname> für 2D (sowohl für den "geometrischen", als auch für den "geographischen" Datentyp) und nur der Operator <varname>&amp;&amp;&amp;</varname> für 3D-Geometrie verwendet werden kann. Die kNN-Suche wird zur Zeit nicht unterstützt.

source: SP-GiST Indexes
de: SP-GiST Indizes

source: SP-GiST stands for "Space-Partitioned Generalized Search Tree" and is a generic form of indexing that supports partitioned search trees, such as quad-trees, k-d trees, and radix trees (tries). The common feature of these data structures is that they repeatedly divide the search space into partitions that need not be of equal size. In addition to GIS indexing, SP-GiST is used to speed up searches on many kinds of data, such as phone routing, ip routing, substring search, etc.
de: SP-GiST steht als Abkürzung für "Space-Partitioned Generalized Search Tree", ein generischer Indextyp der partitionierte Baumstrukturen, wie Quadtree, k-d Baum und Radix-Trie unterstützt. Diese Datenstrukturen haben die gemeinsame Eigenschaft, dass sie den Suchraum in mehrere Partitionen unterteilen, die unterschiedlich groß sein können. Zusätzlich zur Indizierung von Geodaten wird der SP-GIST Index zur Beschleunigung der Suche von vielen Datentypen verwendet, wie bei Telefon Routing, IP Routing, String-Matching-Algorithmen, etc.

source: As it is the case for GiST indexes, SP-GiST indexes are lossy, in the sense that they store the bounding box englobing the spatial objects. SP-GiST indexes can be considered as an alternative to GiST indexes. The performance tests reveal that SP-GiST indexes are especially beneficial when there are many overlapping objects, that is, with so-called “spaghetti data”.
de: So wie der GiST Index, ist auch der SP-GiST Index insofern nicht verlustfrei, da nur die umschreibenden Rechtecke der Geoobjekte gespeichert werden. Der SP-GiST Index kann als Alternative zum GiST Index gesehen werden. Die Performanztests zeigten, dass der SP-GiST Index insbesondere bei vielen überlappenden Objekten Vorteile haben, wie dies bei sogenannten "Spaghettidaten" der Fall ist.

source: Once a GIS data table exceeds a few thousand rows, an SP-GiST index may be used to speed up spatial searches of the data. The syntax for building an SP-GiST index on a "geometry" column is as follows:
de: Sobald eine Geodatentabelle einige tausend Zeilen überschreitet, kann es sinnvoll sein einen SP-GIST Index zu erzeugen, um die räumlichen Abfragen auf die Daten zu beschleunigen. Die Syntax zur Erstellung eines SP-GIST Index auf eine "Geometriespalte" lautet:

source: The above syntax will build a 2-dimensional index. A 3-dimensional index for the geometry type can be created using the 3D operator class:
de: Die obere Syntax erzeugt einen 2D-Index. Ein 3-dimensionaler Index für den geometrischen Datentyp können Sie mit der 3D Operatorklasse erstellen:

source: Building a spatial index is a computationally intensive operation. It also blocks write access to your table for the time it creates, so on a production system you may want to do in in a slower CONCURRENTLY-aware way:
de: Die Erstellung eines räumlichen Indizes ist eine rechenintensive Aufgabe. Während der Erstellung wird auch der Schreibzugriff auf die Tabelle blockiert. Bei produktiven Systemen empfiehlt sich daher die langsamere Option CONCURRENTLY:

source: An SP-GiST index can accelerate queries involving the following operators:
de: Ein SP-GiST Index kann Abfragen mit folgenden Operatoren beschleunigen:

source: &lt;&lt;, &amp;&lt;, &amp;&gt;, &gt;&gt;, &lt;&lt;|, &amp;&lt;|, |&amp;&gt;, |&gt;&gt;, &amp;&amp;, @&gt;, &lt;@, and ~=, for 2-dimensional indexes,
de: &lt;&lt;, &amp;&lt;, &amp;&gt;, &gt;&gt;, &lt;&lt;|, &amp;&lt;|, |&amp;&gt;, |&gt;&gt;, &amp;&amp;, @&gt;, &lt;@, and ~=, für 2-dimensionale Iindices,

source: &amp;/&amp;, ~==, @&gt;&gt;, and &lt;&lt;@, for 3-dimensional indexes.
de: &amp;/&amp;, ~==, @&gt;&gt;, and &lt;&lt;@, für 3-dimensionale Indices.

source: There is no support for kNN searches at the moment.
de: kNN Suche wird zurzeit nicht unterstützt.

source: Using Indexes
de: Verwendung von Indizes

source: Ordinarily, indexes invisibly speed up data access: once the index is built, the query planner transparently decides when to use index information to speed up a query plan. Unfortunately, the PostgreSQL query planner sometimes does not optimize the use of GiST indexes well, so sometimes searches which should use a spatial index instead may perform a sequential scan of the whole table.
de: Üblicherweise beschleunigen Indizes den Datenzugriff: Sobald der Index aufgebaut ist, entscheidet der Anfrageoptimierer, ob der Index den Auswertungsplan bescheunigt. Unglücklicherweise optimiert der Anfrageoptimierer von PostgreSQL die Verwendung von GIST Indizes nicht sehr gut, so dass manchmal eine Suche, welche die Verwendung eines räumlichen Index bedingen sollte, über einen Full Table Scan ausgeführt wird.

source: If you find your spatial indexes are not being used (or your attribute indexes, for that matter) there are a couple things you can do:
de: Wenn Sie bemerken, dass Ihre räumlichen Indizes (oder Ihre Attributindizes) nicht verwendet werden, gibt es mehrere Möglichkeiten:

source: Firstly, read query plan and check your query actually tries to compute the thing you need. A runaway JOIN condition, either forgotten or to the wrong table, can unexpectedly bring you all of your table multiple times. To get query plan, add EXPLAIN keyword in front of your query.
de: Zunächst sollten Sie sich den Auswertungsplan ansehen und überprüfen ob Ihre Abfrage tatsächlich das berechnet was Sie benötigen. Eine unkontrollierte Join-Bedingung, entweder vergessen oder auf eine falsche Tabelle gesetzt, kann alle Datensätze Ihrer Tabelle mehrmals hinzuziehen. Fügen Sie das Schlüsselwort EXPLAIN an den Anfang Ihrer bAbfrage, um den Auswertungsplan zu erhalten.

source: Second, make sure statistics are gathered about the number and distributions of values in a table, to provide the query planner with better information to make decisions around index usage. <command>VACUUM ANALYZE</command> will compute both.
de: Als nächstes sollten Sie sicherstellen, dass eine Statistik über die Anzahl und die Verteilung der Tabellenwerte erfasst wurde, damit dem Anfrageoptimierer bessere Informationen zur Entscheidungsfindung bezüglich zu verwendender Indizes zur Verfügung steht. <command>VACUUM ANALYZE</command> errechnet beide.

source: You should regularly vacuum your databases anyways - many PostgreSQL DBAs have <command>VACUUM</command> run as an off-peak cron job on a regular basis.
de: Sie sollten ohnehin regelmäßig ein Vacuum Ihrer Datenbanken durchführen - viele PostgreSQL DBAs führen ein regelmäßiges<command>VACUUM</command> außerhalb der Spitzenzeiten mittels Cronjob aus.

source: If vacuuming does not help, you can temporarily force the planner to use the index information by using the <command>set enable_seqscan to off;</command> command. This way you can check whether planner is at all capable to generate an index accelerated query plan for your query. You should only use this command only for debug: generally speaking, the planner knows better than you do about when to use indexes. Once you have run your query, do not forget to set <varname>ENABLE_SEQSCAN</varname> back on, so that other queries will utilize the planner as normal.
de: Wenn VACUUM nicht hilft, können Sie den Anfrageoptimierer vorübergehend dazu zwingen den Index zu verwenden, indem Sie den Befehl <command>set enable_seqscan to off;</command> ausführen. Auf diese Weise können Sie feststellen, ob es dem Anfrageoptimierer überhaupt möglich ist, einen indexbeschleunigten Auswertungsplan für Ihre Abfrage zu erstellen. Sie sollten diesen Befehl nur zu Testzwecken: d.h. der Anfrageoptimierer weiß am besten Bescheid wann welcher Index verwendet werden soll. Sobald Sie Ihre Abfrage ausgeführt haben, sollten Sie daher <varname>ENABLE_SEQSCAN</varname> wieder auf ON stellen, damit weitere Abfragen den Anfrageoptimierer wie üblich nutzen können.

source: If <command>set enable_seqscan to off;</command> helps your query to run, your Postgres is likely not tuned for your hardware. If you find the planner wrong about the cost of sequential vs index scans try reducing the value of <varname>random_page_cost</varname> in postgresql.conf or using <command>set random_page_cost to 1.1;</command>. Default value for the parameter is 4, try setting it to 1 (on SSD) or 2 (on fast magnetic disks). Decreasing the value makes the planner more inclined of using Index scans.
de: Wenn <command>set enable_seqscan to off;</command> bei Ihrer Abfrage hilft, dann ist Ihr Postgres vermutlich nicht mit Ihrer Hardware abgestimmt. Wenn Sie herausfinden, daß sich der Anfrageoptimierer bezüglich der Kosten des Full Table Scan im Verhältnis zum Index Scan irrt, können Sie versuchen den Wert von <varname>randam_page_cost</varname> in "postgresql.conf" zu reduzieren, oder <command>set random_page_cost to 1.1;</command> ausführen. Der Standardwert des Parameters ist 4, versuchen Sie ihn auf 1 (auf einer SSD) oder auf 2 (auf einem schnellen magnetischen Festplattenlaufwerk) zu setzen. Eine Verringerung des Wertes führt dazu, dass der Anfrageoptimierer eher den Index Scan verwendet.

source: If <command>set enable_seqscan to off;</command> does not help your query, it may happen you use a construction Postgres is not yet able to untangle. A subquery with inline select is one example - you need to rewrite it to the form planner can optimize, say, a LATERAL JOIN.
de: Wenn<command>set enable_seqscan to off;</command> bei Ihrer Abfrage nicht hilft, kann es sein, dass Sie ein Konstrukt verwenden das Postgres noch nicht entwirren kann. Eine Unterabfrage mit einem Inlineselect wäre so ein Fall -Sie müssen dies in eine Form bringen, die der Anfrageoptimierer nützen kann, z.B. mit einem LATERAL JOIN.

source: Complex Queries
de: Komplexe Abfragen

source: The <emphasis>raison d'etre</emphasis> of spatial database functionality is performing queries inside the database which would ordinarily require desktop GIS functionality. Using PostGIS effectively requires knowing what spatial functions are available, and ensuring that appropriate indexes are in place to provide good performance. The SRID of 312 used in these examples is purely for demonstration. You should be using a REAL SRID listed in the the spatial_ref_sys table and one that matches the projection of your data. If your data has no spatial reference system specified, you should be THINKING very thoughtfully why it doesn't and maybe it should.
de: <emphasis>Sinn und Zweck</emphasis> der Geodatenbankfunktionalität ist, Abfragen innerhalb der Datenbank auszuführen, welche üblicherweise die Funktionalität eines Desktop-GIS benötigen würden. Um PostGIS effizient zu nutzen, müssen Sie die verfügbaren räumlichen Funktionen kennen und sicherstellen, dass die geeigneten Indizes vorhanden sind um eine gute Performanz zu gewährleisten. Die SRID von 312, die in diesen Beispielen verwendet wird, ist für bloße Demonstrationszwecke gedacht. Sie sollten eine ECHTE SRID aus der Tabelle "spatial_ref_sys" verwenden, die auch mit der Projektion Ihrer Daten übereinstimmen muss. Falls Ihren Daten kein Koordinatenreferenzsystem zugewiesen ist, sollten Sie genau eruieren warum dies so ist.
