Repository: solosciences/configs
Catalog: postgis-3.0.1/doc/po/*/using_postgis_dataman.xml.po
Languages: de

source: Using PostGIS: Data Management and Queries
de: PostGIS anwenden: Datenverwaltung und Abfragen

source: GIS Objects
de: GIS Objekte

source: The GIS objects supported by PostGIS are a superset of the "Simple Features" defined by the OpenGIS Consortium (OGC). PostGIS supports all the objects and functions specified in the OGC "Simple Features for SQL" specification.
de: Die Geoobjekte, die von PostGIS unterstützt werden, sind eine Obermenge der durch das OpenGIS Consortium (OGC) festgelegten "Simple Features". PostGIS unterstützt sämtliche Objekte und Funktionen, die in der OGC "Simple Features for SQL" Spezifikation normiert sind.

source: PostGIS extends the standard with support for 3DZ, 3DM and 4D coordinates.
de: PostGIS erweitert den Standard mit der Unterstützung von 3DZ-, 3DM -und 4D-Koordinaten.

source: OpenGIS WKB and WKT
de: OpenGIS WKB und WKT

source: The OpenGIS specification defines two standard ways of expressing spatial objects: the Well-Known Text (WKT) form and the Well-Known Binary (WKB) form. Both WKT and WKB include information about the type of the object and the coordinates which form the object.
de: Die OpenGIS Spezifikation standardisiert zwei Möglichkeiten um Geoobjekte darzustellen: die Well-known-Text (WKT) und die Well-Known-Binary (WKB) Darstellung. Sowohl WKT als auch WKB enthalten Information über den Objekttyp und die Koordinaten, die das Objekt bilden.

source: Examples of the text representations (WKT) of the spatial objects of the features are as follows:
de: Beispiele für die Textdarstellung (WKT) von Geoobjekten:

source: The OpenGIS specification also requires that the internal storage format of spatial objects include a spatial referencing system identifier (SRID). The SRID is required when creating spatial objects for insertion into the database.
de: Die OpenGIS Spezifikation verlangt auch, dass das der Identifikator des Koordinatenreferenzsystem (SRID) im internen Format der Geoobjekte mit abgespeichert ist.

source: Input/Output of these formats are available using the following interfaces:
de: Für die Ein- und Ausgabe dieser Formate stehen die folgenden Schnittstellen zur Verfügung

source: For example, a valid insert statement to create and insert an OGC spatial object would be:
de: Eine gültige Einfügeanweisung, um ein räumliches OGC-Objekt zu erzeugen und einzufügen, wäre:

source: PostGIS EWKB, EWKT and Canonical Forms
de: PostGIS EWKB, EWKT und Normalformen/kanonische Formen

source: OGC formats only support 2D geometries, and the associated SRID is *never* embedded in the input/output representations.
de: Das OGC Format unterstützt nur 2D-Geometrien, und die dazugehörige SRID ist *niemals* in den Eingabe/Ausgabe-Darstellungen eingebettet.

source: PostGIS extended formats are currently superset of OGC one (every valid WKB/WKT is a valid EWKB/EWKT) but this might vary in the future, specifically if OGC comes out with a new format conflicting with our extensions. Thus you SHOULD NOT rely on this feature!
de: Zur Zeit sind die erweiterten Formate von PostGIS eine Obermenge von den OGC-Formaten (jeder gültige WKT/WKB ist auch ein gültiger EWKT/EWKB). Dies kann sich in der Zukunft allerdings ändern, insbesondere dann, wenn OGC ein neues Format einführt, welches mit diesen Erweiterungen im Widerspruch steht. Daher sollten SIE sich BITTE NICHT auf diese Eigenschaft verlassen!

source: Examples of the text representations (EWKT) of the extended spatial objects of the features are as follows.
de: Beispiele für die Textdarstellung (EWKT) von erweiterten Geoobjekten:

source: SRID=32632;POINT(0 0) -- XY with SRID
de: SRID=32632;POINT(0 0) -- XY mit SRID

source: SRID=4326;MULTIPOINTM(0 0 0,1 2 1) -- XYM with SRID
de: SRID=4326;MULTIPOINTM(0 0 0,1 2 1) -- XYM mit SRID

source: Conversion between these formats is available using the following interfaces:
de: Für die Konvertierung zwischen diesen Formaten stehen die folgenden Schnittstellen zur Verfügung:

source: For example, a valid insert statement to create and insert a PostGIS spatial object would be:
de: Zum Beispiel würde eine gültige Eingabeanweisung, um räumliche PostGIS Objekte zu erzeugen und einzufügen, wie folgt lauten:

source: The "canonical forms" of a PostgreSQL type are the representations you get with a simple query (without any function call) and the one which is guaranteed to be accepted with a simple insert, update or copy. For the PostGIS 'geometry' type these are:
de: Die "kanonische Form" eines PostgreSQL Datentyps ist jene Darstellung die man mit einer einfachen Abfrage (ohne Funktionsaufruf) erhält und bei der sichergestellt ist, dass sie von einem einfachen INSERT, UPDATE oder COPY angenommen wird. Beim geometrischen Datentyp von PostGIS sind dies:

source: - Output - binary: EWKB ascii: HEXEWKB (EWKB in hex form) - Input - binary: EWKB ascii: HEXEWKB|EWKT
de: - Ausgabe - binary: EWKB ascii: HEXEWKB (EWKB in hex form) - Eingabe - binary: EWKB ascii: HEXEWKB|EWKT

source: For example this statement reads EWKT and returns HEXEWKB in the process of canonical ascii input/output:
de: Zum Beispiel liest die folgende Anweisung EWKT ein und gibt HEXEWKB in Normalform aus:

source: The SQL Multimedia Applications Spatial specification extends the simple features for SQL spec by defining a number of circularly interpolated curves.
de: Die "SQL Multimedia Applications Spatial" Spezifikation erweitert die SQL Spezifikation für Simple Features indem es eine Reihe von kreisförmig interpolierten Kurven definiert.

source: The SQL-MM definitions include 3DM, 3DZ and 4D coordinates, but do not allow the embedding of SRID information.
de: Die Definitionen in SQL-MM schließen 3DM-, 3DZ- und 4D-Koordinaten ein, erlauben allerdings nicht das Einbinden von Information über SRID.

source: The Well-Known Text extensions are not yet fully supported. Examples of some simple curved geometries are shown below:
de: Die Erweiterungen zur Well-known-Text-Darstellung werden zur Zeit noch nicht zur Gänze unterstützt. Im Folgenden werden Beispiele für einige einfache gekrümmte Geometrien gezeigt:

source: The CIRCULARSTRING is the basic curve type, similar to a LINESTRING in the linear world. A single segment required three points, the start and end points (first and third) and any other point on the arc. The exception to this is for a closed circle, where the start and end points are the same. In this case the second point MUST be the center of the arc, ie the opposite side of the circle. To chain arcs together, the last point of the previous arc becomes the first point of the next arc, just like in LINESTRING. This means that a valid circular string must have an odd number of points greater than 1.
de: CIRCULARSTRING ist der grundlegende Kurventyp, ähnlich wie LINESTRING in der linearen Welt. Ein einziges Segment benötigt drei Punkte, den Anfangs- und den Endpunkt (erster und dritter) und irgendeinen weiterer Punkt auf dem Kreisbogen. Eine Ausnahme ist der geschlossene Kreis, wo Anfangs- und Endpunkt ident sind. In diesem Fall muss der zweite Punkt dem Kreismittelpunkt entsprechen. Um Kreisbögen aneinanderzuketten, wird der Endpunkt des vorangehenden Bogens zum Anfangspunkt des nächstfolgenden Bogens, genauso wie beim LINESTRING. D.h., dass ein Kreisbogen eine ungerade Anzahl an Punkten grösser als 1 aufweisen muss.

source: A compound curve is a single, continuous curve that has both curved (circular) segments and linear segments. That means that in addition to having well-formed components, the end point of every component (except the last) must be coincident with the start point of the following component.
de: Eine zusammengesetzte Kurve ist eine einzelne, durchgängige Kurve, die sowohl gekrümmte (kreisförmige) als auch gerade Segmente aufweist. Dies bedeutet, daß die Komponenten nicht nur wohlgeformt sein müssen, sondern auch der Endpunkt einer jeden Komponente (außer der letzten) mit dem Anfangspunkt der nachfolgenden Komponente zusammenfallen muss.

source: Example compound curve in a curve polygon: CURVEPOLYGON(COMPOUNDCURVE(CIRCULARSTRING(0 0,2 0, 2 1, 2 3, 4 3),(4 3, 4 5, 1 4, 0 0)), CIRCULARSTRING(1.7 1, 1.4 0.4, 1.6 0.4, 1.6 0.5, 1.7 1) )
de: Beispiel einer zusammengesetzten Kurve in einem Kurvenpolygon: CURVEPOLYGON(COMPOUNDCURVE(CIRCULARSTRING(0 0,2 0, 2 1, 2 3, 4 3),(4 3, 4 5, 1 4, 0 0)), CIRCULARSTRING(1.7 1, 1.4 0.4, 1.6 0.4, 1.6 0.5, 1.7 1) )

source: A CURVEPOLYGON is just like a polygon, with an outer ring and zero or more inner rings. The difference is that a ring can take the form of a circular string, linear string or compound string.
de: Ein CurvePolygon hat, genau wie ein Polygon, einen äußeren Ring und keinen oder mehrere innere Ringe. Der Unterschied liegt darin, dass ein Ring aus Kreisbögen, Geraden oder zusammengesetzten Strecken bestehen kann.

source: As of PostGIS 1.4 PostGIS supports compound curves in a curve polygon.
de: Ab PostGIS 1.4 werden zusammengesetzte Kurven/CompoundCurve in einem Kurvenpolygon/CurvePolygon unterstützt.

source: The MULTICURVE is a collection of curves, which can include linear strings, circular strings or compound strings.
de: Eine MultiCurve ist eine Sammelgeometrie von Kurven, welche aus Geraden, Kreisabschnitte oder zusammengesetzten Abschnitten bestehen kann.

source: This is a collection of surfaces, which can be (linear) polygons or curve polygons.
de: Dies ist eine Sammelgeometrie von Oberflächen, welche (lineare) Polygone oder Kurvenpolygone sein können.

source: All floating point comparisons within the SQL-MM implementation are performed to a specified tolerance, currently 1E-8.
de: Alle Gleitpunkt Vergleiche der SQL-MM Implementierung werden mit einer bestimmten Toleranz ausgeführt, zurzeit 1E-8.

source: PostGIS Geography Type
de: Der geographische Datentyp von PostGIS

source: The geography type provides native support for spatial features represented on "geographic" coordinates (sometimes called "geodetic" coordinates, or "lat/lon", or "lon/lat"). Geographic coordinates are spherical coordinates expressed in angular units (degrees).
de: Der geographische Datentyp bietet native Unterstützung für Geoobjekte die durch "geographische" Koordinaten (manchmal auch als "geodätische" Koordinaten, "Länge/Breite" oder "Breite/Länge" bezeichnet) festgelegt sind. Geographische Koordinaten sind Kugelkoordinaten, die durch Winkel (in Grad) angegeben werden.

source: The basis for the PostGIS geometry type is a plane. The shortest path between two points on the plane is a straight line. That means calculations on geometries (areas, distances, lengths, intersections, etc) can be calculated using cartesian mathematics and straight line vectors.
de: Der geometrische Datentyp von PostGIS beruht auf der Ebene. Die kürzeste Entfernung zwischen zwei Punkten einer Ebene entspricht einer Gerade. Das bedeutet, dass geometrische Berechnungen (wie Flächen, Distanzen, Längen, Schnittpunkte, etc.) im kartesischen Koordinatensystem mit geradlinigen Vektoren ausgeführt werden können.

source: The basis for the PostGIS geographic type is a sphere. The shortest path between two points on the sphere is a great circle arc. That means that calculations on geographies (areas, distances, lengths, intersections, etc) must be calculated on the sphere, using more complicated mathematics. For more accurate measurements, the calculations must take the actual spheroidal shape of the world into account.
de: Der geographische Datentyp von PostGIS beruht auf einer Kugel. Die kürzeste Verbindung zwischen zwei Punkten auf einer Kugeloberfläche ist ein Bogenteil eines Großkreises. D.h., dass Berechnungen auf geographische Datentypen (wie Flächen, Distanzen, Längen, Schnittpunkte, etc.) auf der Kugeloberfläche mit einer komplexeren Mathematik durchgeführt werden müssen. Für genauere Messungen müssen die Berechnungen das Rotationsellipsoid der Erde in Betracht ziehen.

source: Because the underlying mathematics is much more complicated, there are fewer functions defined for the geography type than for the geometry type. Over time, as new algorithms are added, the capabilities of the geography type will expand.
de: Da die zugrunde liegende Mathematik wesentlich schwieriger ist, gibt es weniger Funktionen für den geographischen Datentyp, als für den geometrischen Datentyp. Mit der Zeit werden neue Algorithmen hinugefügt und die Möglichkeiten des geographischen Datentyps erweitert werden.

source: It uses a data type called <varname>geography</varname>. None of the GEOS functions support the <varname>geography</varname> type. As a workaround one can convert back and forth between geometry and geography types.
de: Es verwendet den Datentyp <varname>geography</varname>, der allerdings von den Funktionen der Bibliothek GEOS in keiner Weise unterstützt wird. Als provisorische Lösung kann man zwischen dem geometrischen und dem geographischen Datentypen hin- und herkonvertieren.

source: Prior to PostGIS 2.2, the geography type only supported WGS 84 long lat (SRID:4326). For PostGIS 2.2 and above, any long/lat based spatial reference system defined in the <varname>spatial_ref_sys</varname> table can be used. You can even add your own custom spheroidal spatial reference system as described in <ulink url="http://www.bostongis.com/blog/index.php?/archives/266-geography-type-is-not-limited-to-earth.html">geography type is not limited to earth</ulink>.
de: Vor PostGIS 2.2 hat der geographische Datentyp nur WGS 84 Länge und Breite (SRID:4326) unterstützt. Ab PostGIS 2.2 kann dieser jedes Koordinatenreferenzsystem verwenden, das auf Länge und Breite basiert und in der Tabelle <varname>spatial_ref_sys</varname>aufgeführt ist. Sie können sogar Ihr eigenes Polarkoordinatenreferenzsystem hinzufügen, wie unter <ulink url="http://www.bostongis.com/blog/index.php?/archives/266-geography-type-is-not-limited-to-earth.html">geography type is not limited to earth</ulink> beschrieben.

source: Regardless which spatial reference system you use, the units returned by the measurement (<xref linkend="ST_Distance"/>, <xref linkend="ST_Length"/>, <xref linkend="ST_Perimeter"/>, <xref linkend="ST_Area"/>) and for input of <xref linkend="ST_DWithin"/> are in meters.
de: Unabhängig vom verwendeten Koordinatenreferenzsystem sind die Einheiten der ausgegebenen Messungen (<xref linkend="ST_Distance"/>, <xref linkend="ST_Length"/>, <xref linkend="ST_Perimeter"/>, <xref linkend="ST_Area"/>) und der Eingabe für <xref linkend="ST_DWithin"/> in Meter.

source: The geography type uses the PostgreSQL typmod definition format so that a table with a geography field can be added in a single step. All the standard OGC formats except for curves are supported.
de: Der geographische Datentyp verwendet die Typmod-Formatangabe von PostgreSQL, sodass eine Tabelle mit einem geographischen Attribut in einem einzigen Schritt erstellt werden kann. Es werden alle Formate des OGC-Standards unterstützt, mit Ausnahme von Kurven.

source: Geography Basics
de: Grundsätzliches zum geographischen Datentyp

source: The geography type does not support curves, TINS, or POLYHEDRALSURFACEs, but other geometry types are supported. Standard geometry type data will autocast to geography if it is of SRID 4326. You can also use the EWKT and EWKB conventions to insert data.
de: Der geographische Datentyp unterstützt Geometrien, ausgenommen sind jedoch Kuven, TINS und POLYHEDRALSURFACEs. Daten vom geometrischen Datentyp, welche eine SRID von 4326 aufweisen, werden implizit in den geographischen Datentyp umgewandelt. Sie können Daten auch entsprechend der EWKT- und EWKB-Konvention einfügen.

source: POINT: Creating a table with 2D point geography when srid is not specified defaults to 4326 WGS 84 long lat:
de: POINT: Erstellung einer 2D-Punkttabelle mit dem geographischen Datentyp. Wenn die SRID nicht festgelegt ist, wird 4326 WGS 84 Länge und Breite angenommen:

source: POINT: Creating a table with 2D point geography in NAD83 longlat:
de: POINT: Erstellung einer Tabelle mit 2D-Punkten als geographischen Datentyp in NAD83 Länge und Breite:

source: Creating a table with z coordinate point and explicitly specifying srid
de: Erstellung einer Punkttabelle mit Z-Koordinaten und explizit angegebener SRID

source: --polygon NAD 1927 long lat CREATE TABLE lgeognad27(gid serial PRIMARY KEY, geog geography(POLYGON,4267) );
de: -- Polygon in NAD 1927 Länge und Breite CREATE TABLE lgeognad27(gid serial PRIMARY KEY, geog geography(POLYGON,4267) );

source: The geography fields get registered in the <varname>geography_columns</varname> system view.
de: Die Attribute des geographischen Datentyps werden in dem System View <varname>geography_columns</varname> registriert.

source: Now, check the "geography_columns" view and see that your table is listed.
de: Nun überprüfen Sie bitte ob Ihre Tabelle in der gespeicherten Abfrage "geography_columns" aufscheint.

source: You can create a new table with a GEOGRAPHY column using the CREATE TABLE syntax.
de: Sie können eine neue Tabelle mit einer geographischen Datentypspalte mit der Syntax von CREATE TABLE erstellen.

source: Note that the location column has type GEOGRAPHY and that geography type supports two optional modifiers: a type modifier that restricts the kind of shapes and dimensions allowed in the column; an SRID modifier that restricts the coordinate reference identifier to a particular number.
de: Beachten Sie bitte, dass die Spalte "location" den geographischen Datentyp verwendet und dieser zwei optionale Modifikatoren unterstützt: Einen Typmodifikator, der die geometrische Form und die Dimension der Geometriespalte festlegt; ein Modifikator für SRID, der den Identifikator für das Koordinatenreferenzsystem auf eine bestimmte Zahl einschränkt.

source: Allowable values for the type modifier are: POINT, LINESTRING, POLYGON, MULTIPOINT, MULTILINESTRING, MULTIPOLYGON. The modifier also supports dimensionality restrictions through suffixes: Z, M and ZM. So, for example a modifier of 'LINESTRINGM' would only allow line strings with three dimensions in, and would treat the third dimension as a measure. Similarly, 'POINTZM' would expect four dimensional data.
de: Für den Typmodifikator sind folgende Werte erlaubt: POINT, LINESTRING, POLYGON, MULTIPOINT, MULTILINESTRING, MULTIPOLYGON. Der Modifikator unterstützt auch Einschränkungen der Dimensionalität durch Nachsilben: Z, M und ZM. So erlaubt zum Beispiel ein Modifikator mit dem Wert 'LINESTRINGM' nur die Eingabe von Linienzügen mit drei Dimensionen, wobei die dritte Dimension als Kilometrierung/measure behandelt wird. Ebenso verlangt 'POINTZM' die Eingabe von vierdimensionalen Daten.

source: If you do not specify an SRID, the SRID will default to 4326 WGS 84 long/lat will be used, and all calculations will proceed using WGS84.
de: Wenn Sie keine SRID angeben, dann wird standardmäßig die SRID 4326 WGS84 Länge/Breite verwendet und alle Berechnungen in WGS84 ausgeführt.

source: Once you have created your table, you can see it in the GEOGRAPHY_COLUMNS table:
de: Sobald Sie Ihre Tabelle erstellt haben, können Sie diese in der Tabelle "geography_columns" sehen:

source: -- See the contents of the metadata view SELECT * FROM geography_columns;
de: -- Metadaten abfragen SELECT * FROM geography_columns;

source: You can insert data into the table the same as you would if it was using a GEOMETRY column:
de: Sie können Daten auf dieselbe Art und Weise in die Tabelle einfügen wie Sie dies bei einer Geometriespalte tun würden:

source: -- Add some data into the test table INSERT INTO global_points (name, location) VALUES ('Town', 'SRID=4326;POINT(-110 30)'); INSERT INTO global_points (name, location) VALUES ('Forest', 'SRID=4326;POINT(-109 29)'); INSERT INTO global_points (name, location) VALUES ('London', 'SRID=4326;POINT(0 49)');
de: -- Ein paar Daten in die Testtabelle einfügen INSERT INTO global_points (name, location) VALUES ('Town', 'SRID=4326;POINT(-110 30)'); INSERT INTO global_points (name, location) VALUES ('Forest', 'SRID=4326;POINT(-109 29)'); INSERT INTO global_points (name, location) VALUES ('London', 'SRID=4326;POINT(0 49)');

source: Creating an index works the same as GEOMETRY. PostGIS will note that the column type is GEOGRAPHY and create an appropriate sphere-based index instead of the usual planar index used for GEOMETRY.
de: Die Erstellung eines Index funktioniert gleich wie beim Datentyp GEOMETRY. PostGIS erkennt, dass es sich um den Datentyp GEOGRAPHY handelt und erzeugt einen entsprechenden, auf einer Kugeloberfläche basierenden Index anstelle des üblichen planaren Index, der für den Datentyp GEOMETRY verwendet wird.

source: -- Index the test table with a spherical index CREATE INDEX global_points_gix ON global_points USING GIST ( location );
de: -- Einen sphärischen Index auf die Testtabelle legen CREATE INDEX global_points_gix ON global_points USING GIST ( location );

source: Query and measurement functions use units of meters. So distance parameters should be expressed in meters, and return values should be expected in meters (or square meters for areas).
de: Anfrage und Messfunktionen verwenden die Einheit Meter. Daher sollten Entfernungsparameter in Metern ausgedrückt werden und die Rückgabewerte sollten ebenfalls in Meter (oder Quadratmeter für Flächen) erwartet werden.

source: -- Show a distance query and note, London is outside the 1000km tolerance SELECT name FROM global_points WHERE ST_DWithin(location, 'SRID=4326;POINT(-110 29)'::geography, 1000000);
de: -- Eine Distanzabfrage; Beachten Sie bitte, dass London ausserhalb der 1000km Toleranz liegt SELECT name FROM global_points WHERE ST_DWithin(location, 'SRID=4326;POINT(-110 29)'::geography, 1000000);

source: You can see the power of GEOGRAPHY in action by calculating how close a plane flying from Seattle to London (LINESTRING(-122.33 47.606, 0.0 51.5)) comes to Reykjavik (POINT(-21.96 64.15)).
de: Sie können die Mächtigkeit von GEOGRAPHY erfahren, indem Sie berechnen, wie nahe ein Flugzeug, das von Seattle nach London (LINESTRING(-122.33 47.606, 0.0 51.5)) fliegt, an Reykjavik (POINT(-21.96 64.15)) vorbeikommt.

source: -- Distance calculation using GEOGRAPHY (122.2km) SELECT ST_Distance('LINESTRING(-122.33 47.606, 0.0 51.5)'::geography, 'POINT(-21.96 64.15)'::geography);
de: -- Die Entfernung mittels GEOGRAPHY ausrechnen (122.2km) SELECT ST_Distance('LINESTRING(-122.33 47.606, 0.0 51.5)'::geography, 'POINT(-21.96 64.15)':: geography);

source: -- Distance calculation using GEOMETRY (13.3 "degrees") SELECT ST_Distance('LINESTRING(-122.33 47.606, 0.0 51.5)'::geometry, 'POINT(-21.96 64.15)'::geometry);
de: -- Die Entfernung mittels GEOMETRIE ausrechnen (13.3 "degrees") SELECT ST_Distance('LINESTRING(-122.33 47.606, 0.0 51.5)'::geometry, 'POINT(-21.96 64.15)':: geometry);

source: Testing different lon/lat projects. Any long lat spatial reference system listed in <varname>spatial_ref_sys</varname> table is allowed.
de: Ausprobieren von verschiedenen Projektionen in Länge/Breie. Es ist jedes Koordinatenreferenzsystem in Länge und Breite zulässig, das in der Tabelle <varname>spatial_ref_sys</varname> aufgeführt ist.

source: -- NAD 83 lon/lat SELECT 'SRID=4269;POINT(-123 34)'::geography; geography ---------------------------------------------------- 0101000020AD1000000000000000C05EC00000000000004140 (1 row)
de: -- NAD 83 in Länge und Breite SELECT 'SRID=4269;POINT(-123 34)'::geography; geography ---------------------------------------------------- 0101000020AD1000000000000000C05EC00000000000004140 (1 row)
